/****************************************Copyright (c)**************************************************
**                                  ____科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: pbcfg.h
**创   建   人: yzy
**最后修改日期: 2019年6月1日
**描        述: 配变系统应用的配置文件，选取需要哪些配变功能
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2008年5月14日
** 描　述: 原始版本
********************************************************************************************************/

#ifndef _PBCFG_H_
#define _PBCFG_H_




/******************************************************************************
**全体信息点使能(如禁能,并不删除所有相关代码,但可节约部分内存开销和该功能大部分运行开销)
******************************************************************************/
#define PB_ALLPN_EN  1





/******************************************************************************
**国网端口号定义宏
******************************************************************************/
#define PORT_JC_NO          1                   //交采端口号
#define PORT_CB1_NO         2                   //第1路485端口号
#define PORT_CB2_NO         3                   //第2路485端口号
#define PORT_CB3_NO         4                   //第3路485端口号
                                                // 
#define PORT_NUM            1                   //总的F33可配置端口数


/************************************************************************ 
**内部端口编号(0-?)
**先排抄表端口,再排其他(为了减少netp进程某些大型结构体的成员数量,以减少内存消耗)
*************************************************************************/
#define MCB_CB1_IDX         0                  //第1路485端口号索引

#define MCB_PORT_NUM        4                  //抄表端口数量


/******************************************************************************
**07表是否使用表内冻结
******************************************************************************/
#define  GDW_07DIN_EN    0              //07表是否使用表内冻结



/************************************************************************
**事件记录配置
*************************************************************************/
#define  ERC1_EN          1             //数据初始化和版本变更
#define  ERC2_EN          0             //(未实现)参数丢失
#define  ERC3_EN          1             //参数变更
#define  ERC4_EN          1             //状态量变位
#define  ERC5_EN          0             //遥控跳闸
#define  ERC6_EN          0             //功控跳闸
#define  ERC7_EN          0             //电控跳闸
#define  ERC8_EN          0             //电能表参数变更
#define  ERC9_EN          0             //电流回路异常
#define  ERC10_EN         0             //电压回路异常
#define  ERC11_EN         0             //相序异常
#define  ERC12_EN         0             //电能表时间超差
#define  ERC13_EN         0             //电能表故障信息
#define  ERC14_EN         1             //终端停上电
#define  ERC15_EN         0
#define  ERC16_EN         0             //(未实现)直流模拟量越限
#define  ERC17_EN         0             //电压电流不平衡越限
#define  ERC18_EN         0             //(未实现)电容器投切自锁
#define  ERC19_EN         0             //购电参数设置
#define  ERC20_EN         0             //(未实现)消息认证错误
#define  ERC21_EN         1             //终端故障
#define  ERC22_EN         0             //差动越限
#define  ERC23_EN         0             //电控告警
#define  ERC24_EN         0             //电压越限
#define  ERC25_EN         0             //电流越限
#define  ERC26_EN         0             //视在功率越限
#define  ERC27_EN         0             //电能示度下降
#define  ERC28_EN         0             //电能超差
#define  ERC29_EN         0             //电能飞走
#define  ERC30_EN         0             //电能停走
#define  ERC31_EN         1             //485抄表失败
#define  ERC32_EN         1             //通讯流量超限
#define  ERC33_EN         1             //状态字变位
#define  ERC37_EN         0             //开表盖
#define  ERC38_EN         0             //开端钮盒
#define  ERC40_EN         0             //磁场异常
#define  ERC41_EN         0             //对时事件记录
#define  ERC60_EN         1             //终端请求测试

#define	ERC39_DLMS_EN         1	//ERC39: 发现新表事件
#define	ERC40_DLMS_EN		  1	//ERC40: 表计标准事件
#define	ERC41_DLMS_EN		  1	//ERC41: 发现欺诈事件
#define	ERC42_DLMS_EN		  1	//ERC42: 发现继电器事件
#define	ERC43_DLMS_EN		  1	//ERC43: 发现电网事件
#define	ERC44_DLMS_EN		  1	//ERC44: 集中器升级、表计升级事件记录
#define	ERC46_DLMS_EN		  1	//ERC46: 删表事件
#define	ERC47_DLMS_EN		  1	//ERC47: 对时事件



/************************************************************************
**遥信数量
*************************************************************************/
#define YX_IOBIT        0               //遥信在慢速口状态字中的起始位
#define YX_NUM          1









#endif

