/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: pst.h
**创   建   人: yzy
**最后修改日期: 2018年3月22日
**描        述: 被动通讯应用管理进程配置头文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2018年3月22日
** 描　述: 原始版本
**-------------------------------------------------------------------------------------------------------
** 修改人: 
** 版  本: 
** 描  述: 
********************************************************************************************************/
#ifndef _PST_H_
#define _PST_H_

#ifndef EXT_PST
#define EXT_PST     extern
#else
#define EXT_PST_SELF
#endif



//yzy 20100311 
EXT_PST uint8 gucs_InpAddr[6];
//	EXT_PST uint8 gucs_FcAddr[6];


    


/***********************************************************************
**定义规约解包函数的类型
**********************************************************************/
typedef uint8 (*PSTDecodeFunc)(uint8*, uint8*, PST_Frame*);

/***********************************************************************
**定义规约处理函数的类型
**********************************************************************/
typedef uint8 (*PSTProcFunc)(PST_Frame*);

/***********************************************************************
**定义规约打包函数的类型
**********************************************************************/
typedef uint8 (*PSTPackFunc)(PST_Frame*, uint8, uint16*);

/***********************************************************************
**定义通道发送函数的类型
**********************************************************************/
typedef uint8 (*PSTChnSend)(uint8* buffer, uint16 length);





//-----------------------------------------------------------------------------------

















/************************************************************************
 * @function: PstFrmProc
 * @描述: 被动通讯处理函数(将FRM设备进行封装,各进程可直接调用该函数)
 * 
 * @参数: 
 * @param: channel  通道号;不同的通道需要处理不通的规约
 * @param: rbuffer  接收缓存
 * @param: length  接收数据内容长度
 * @param: sbuffer 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2018年3月22日)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 PstFrmProc(PORT_UART_TYPE channel, uint8* rbuffer, uint16 length, uint8* sbuffer, uint16 sbuflen);


/************************************************************************
 * @function: PST_CHN0_Send
 * @描述: 通道发送
 * 
 * @参数: 
 * @param: buffer 发送数据的缓存
 * @param: len 发送数据的长度
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2018年3月22日)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 PST_CHN0_Send(uint8* buffer, uint16 len);
uint8 PST_CHN1_Send(uint8* buffer, uint16 len);
uint8 PST_CHN2_Send(uint8* buffer, uint16 len);
uint8 PST_CHN3_Send(uint8* buffer, uint16 len);
uint8 PST_CHN4_Send(uint8* buffer, uint16 len);
uint8 PST_CHN5_Send(uint8* buffer, uint16 len);






/************************************************************************
 * @function: PST_Init
 * @描述: 被动进程初始化
 * @参数: 
 * @返回: 
 * @说明: 
 * @作者: yzy (2018年3月22日)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void PST_Init(void);


//	/************************************************************************
//	 * @function: PST_PreInit
//	 * @描述: 被动进程初始化
//	 * @参数: 
//	 * @返回: 
//	 * @说明: 
//	 * @作者: yzy (2018年3月22日)
//	 *-----------------------------------------------------------------------
//	 * @修改人: 
//	 ************************************************************************/
//	void PST_PreInit(void);
/************************************************************************
 * @function: Setp_RecvProc
 * @描述: 设置端口接收到数据之后的数据处理
 * @参数: 
 * @返回: 
 * @说明: 
 * @作者: yzy (2018年3月22日)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void Setp_RecvProc(void);

/************************************************************************
**函数名称: void PST_UpdateVar(void* pdata)
**描 述: 链路层参数初始化
**
**输 入: 
**输 出: 
**
**备 注: 未对数据有效性进行检查
**-----------------------------------------------------------------------
**作 者: yzy
**日 期: 08-09-09
*************************************************************************/
void PST_UpdateVar(void);


uint8 LoadSystemParam(uint16 PType);

uint8 CheckFileHead(uint8* head);

#ifdef EXT_PST_SELF


/******************************************************************************
**被动通道发送函数
******************************************************************************/
const PSTChnSend gfs_PSTChnSend[PST_CHN_NO] = 
{
    PST_CHN0_Send,                      //本地485
    PST_CHN1_Send,                      //GPRS
    PST_CHN2_Send,                      //netp0
    PST_CHN3_Send,                      //netp1
    PST_CHN4_Send,                      //netp2
    PST_CHN5_Send,                      //netp3
    
};





#else                                       //#ifdef EXT_PST_SELF

EXT_PST const PSTChnSend gfs_PSTChnSend[];

EXT_PST const S_FILEBLOCKS gss_FileBlocks[];
//EXT_PST const uint8 LEN_DB_LIST;
    
#endif                                       //#ifdef EXT_PST_SELF




#endif

