/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: sys.h
**创   建   人: yzy
**最后修改日期: 2010年1月14日
**描        述: rtos操作系统的头文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2010年1月14日
** 描　述: 原始版本
********************************************************************************************************/

#ifndef _SYS_H_
#define _SYS_H_

#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>

//系统平台预定义
#include "aos/bdef.h"


//功能配置宏
#include "ext.h"


//cmsis,chip,os
//#include "sys_os.h"
#include "chip.h"

//配置相关变量声明(声明在配置文件和HAL/DEV层中用到的类型)
#include "cdef.h"


//配置头文件
#include "msgid.h"              //编号列表
#include "iomap.h"              //io口配置
//#include "ramap.h"              //ram配置




//通用函数库文件
#include "libs.h"


#include "aos/kernel.h"

#endif

