/***********************************************************************************************************************
* 文件名：dev_hall.h
* 版  本：
* 描  述：霍尔计数流程应用头文件
* 开发者：
* 日  期：
***********************************************************************************************************************/
#ifndef _DEV_HALL_H_
#define _DEV_HALL_H_

/***********************************************************************************************************************
Macro definitions 宏定义
***********************************************************************************************************************/
#define HALL_A          0
#define HALL_B          1

#define HALL_ISNORMAL   0
#define HALL_ISERR      1

/***********************************************************************************************************************
Typedef definitions 类型定义
***********************************************************************************************************************/
//霍尔计数结构体，需要保存
typedef struct _ST_HallCount_
{
    unsigned char HallACount;
    unsigned char HallBCount;

}ST_HALL_COUNT;

//霍尔计量结构体
typedef struct _HallCheck_ST
{
    unsigned char   Run;                            //霍尔检测在运行标志 0：未运行 1：运行
    unsigned char   Step;                           //霍尔检测进程：0：消抖   1：磁攻击检测
    unsigned short  Count;                          //消抖，磁攻击判断计时计数 
    
    unsigned short  TimeFilter;                     //消抖计时
    unsigned short  TimeHallAttack;                 //磁攻击计时
    unsigned char   (*GetPortInput)(void);          //获取引脚电平
    void            (*HallAttackFun)(void);         //磁攻击回调函数
    void		    (*HallPulseFun)(void);          //霍尔有效脉冲回调函数
}HallCheck_ST, *pHallCheck_ST;

/***********************************************************************************************************************
Global functions全局函数
***********************************************************************************************************************/
extern ST_HALL_COUNT    HallCount;
/*
 *  霍尔初始化
 */
void InitHall(void);
/*
 * 磁攻击判断，初始化和按键时调用，只有这两种情况下可以清表具磁攻击状态位和清磁攻击阀门控制权
 */
void HallAttackCheck(void);
/*
 * 获取当前Hall状态
 */
unsigned char GetHallState(void);

#endif
