/******************************Copyright(c)******************************
**                         
**
** File Name: dev_realtime.h
** Author: 实时时钟设备头文件
** Date Last Update: 2019-11-02
** Description: 
** Note: 
*******************************History***********************************
** Date: 2019-11-02
** Author: yzy
** Description: 文件创建
*************************************************************************/
#ifndef _REALTIME_H_
#define _REALTIME_H_


#ifndef EXT_DEV_REALTIME
#define EXT_DEV_REALTIME  extern
#endif





/******************************************************************************
**外部应用对该模块操作时的操作码
******************************************************************************/
enum
{
    HRTC_RW_RB = 0,                         //读取BCD格式时间
    HRTC_RW_RH = 1,                         //读取HEX格式时间
    HRTC_RW_WB = 2,                         //写入BCD格式时间
    HRTC_RW_WH = 3,                         //写入HEX格式时间
};






/******************************************************************************
**终端持续运行时间
**(外部应用请使用GetSysRunSecs接口函数,2015-01-27)
******************************************************************************/
EXT_DEV_REALTIME uint32 gul_SysRunSecs;


/************************************************************************
 * @Function: SYS_RTC_Init
 * @Description: 设备模块初始化
 * @Arguments: 
 * @Note: 
 * @Auther: yzy
 * Date: 2015/6/1
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
void SYS_RTC_Init(void);



/************************************************************************
 * @Function: SYS_WriteDateTime
 * @Description: 设置时间,格式HEX
 * 
 * @Arguments: 
 * @param: datetime 
 * 
 * @Note: 
 * @Return: uint8  
 * @Auther: yzy
 * Date: 2015/6/1
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
uint8 SYS_WriteDateTime(TIME* datetime);


/************************************************************************
 * @Function: SYS_WriteBCDDateTime
 * @Description: 设置时间,格式bcd
 * 
 * @Arguments: 
 * @param: datetime 
 * 
 * @Note: 
 * @Return: uint8  
 * @Auther: yzy
 * Date: 2015/6/1
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
uint8 SYS_WriteBCDDateTime(TIME* datetime);


/************************************************************************
 * @Function: SYS_ReadDateTime
 * @Description: 读取时间,格式HEX
 * 
 * @Arguments: 
 * @param: datetime 
 * 
 * @Note: 
 * @Return: uint8  
 * @Auther: yzy
 * Date: 2015/6/1
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
uint8 SYS_ReadDateTime(TIME* datetime);


/************************************************************************
 * @Function: SYS_ReadBCDDateTime
 * @Description: 读取时钟,格式bcd
 * 
 * @Arguments: 
 * @param: datetime 
 * 
 * @Note: 
 * @Return: uint8  
 * @Auther: yzy
 * Date: 2015/6/1
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
uint8 SYS_ReadBCDDateTime(TIME* datetime);



/************************************************************************
 * @Function: GetTime
 * @Description: 获取当前的时间和日期的全部信息, 这个信息只读
 * @Arguments: 
 * 
 * @Note: 
 * @Return: const TIME*  
 * @Auther: yzy
 * Date: 2015/6/1
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
const TIME* GetTime(void);



/************************************************************************
 * @Function: GetSysRunSecs
 * @Description: 获取系统连续运行时间
 * @Arguments: 
 * 
 * @Note: 
 * @Return: uint32  
 * @Auther: yzy
 * Date: 2015/6/1
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
uint32 GetSysRunSecs(void);


void APP_RTC_Init(void);
void APP_RTC_DeInit(void);


#endif

