/******************************Copyright(c)******************************
**                          
**
** File Name: dev_wdt.c
** Author: 
** Date Last Update: 2019-11-02
** Description: 看门狗设备头文件
** Note: 
*******************************History***********************************
** Date: 2019-11-02
** Author: yzy
** Description: 文件创建
*************************************************************************/
#ifndef _DEV_WDT_H_
#define _DEV_WDT_H_


#ifndef EXT_DEV_WDT
#define EXT_DEV_WDT extern
#endif
 



/************************************************************************
**辅助喂狗计数器(看门狗喂狗时间<1s时)
*************************************************************************/
EXT_DEV_WDT uint8 guc_TickDogFeedCnt;       //单位100ms
EXT_DEV_WDT uint8 guc_TickDogFeedDIS;       //0xaa表示禁止扩展看门狗功能




/************************************************************************
 * @Function: SYS_WDT_Init
 * @Description: 看门狗设备初始化
 * @Arguments: 
 * @Note: 
 * @Auther: yzy
 * Date: 2015/5/31
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
void SYS_WDT_Init(void);


/************************************************************************
 * @Function: SYS_WDT_Feed
 * @Description: 喂狗
 * 
 * @Arguments: 
 * @param: wdttick wdttick.狗的寿命(单位100ms)
 * @Note: 
 * @Auther: yzy
 * Date: 2015/5/31
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
void SYS_WDT_Feed(uint8 wdttick);


/************************************************************************
 * @Function: SYS_WDT_DIS
 * @Description: 停止喂狗
 * @Arguments: 
 * @Note: 仅限测试使用.注意,有外部看门狗的时候禁用内部看门狗.否则测试时无法有效测试外部看门狗
 * @Auther: yzy
 * Date: 2015/5/31
 *-----------------------------------------------------------------------
 * @History: 
 ************************************************************************/
void SYS_WDT_DIS(void);



#endif







