/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: led.h
**创   建   人: yzy
**最后修改日期: 2018年4月25日
**描        述: led驱动模块的头文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2018年4月25日
** 描　述: 原始版本
********************************************************************************************************/
#ifndef _DEV_LED_H_
#define _DEV_LED_H_


#ifndef EXT_DEV_LED
#define EXT_DEV_LED extern
#endif
 




/******************************************************************************
**LED亮灯结构体信息
******************************************************************************/
typedef struct
{
    uint8  type;                         //表示灯亮的类型(0只亮一下,1闪烁,2常亮,其他灭)
    uint8  off_interval;                 //表示灯熄灭间隔(type == 1有效)
    uint8  on_interval;                  //表示灯点亮间隔(type == 1有效)
    uint8  curstt;                       //当前是on还是off.0表示off.
    uint16 time;                         //表示灯作用持续时间(0xFFFF表示永久有效)
    uint8  count;                        //表示灯闪烁计时器(type == 1有效)
}LedLights;

EXT_DEV_LED LedLights* gsp_LedLights;






/*******************************************************************************
 * @function_name:  SYS_LED_OnOff
 * @function_file:  dev_gpio.c
 * @描述: LED开关函数
 * @参数: 
 * @param: led(LEDNO): 
 * @param: oc(uint8): true点亮, false 熄灭
 * @返回: 
 * @作者: yzy (2010-03-11)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_LED_OnOff(uint32 led, uint8 oc);

/*******************************************************************************
 * @function_name:  SYS_LED_Init
 * @function_file:  dev_gpio.c
 * @描述: LED初始化
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2010-03-11)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_LED_Init(void);


/************************************************************************
 * @function: SYS_LED_BlinkSet
 * @描述: LED点亮熄灭接口函数
 * 
 * @参数: 
 * @param: led 操作的LED灯序号
 * @param: type 0 只亮一下, 1 闪烁, 2 常亮,其他 熄灭
 * @param: interval 闪烁间隔,时间单位100ms(type为1时有效)
 * @param: time 亮的时间 单位1s(0表示永久有效)
 * @返回: 
 * @说明: 
 * @作者: yzy (2013/6/8)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void SYS_LED_BlinkSet(LedNo led, uint8 type, uint8 interval, uint8 time);


/************************************************************************
 * @function: SYS_LED_BlinkSetAll
 * @描述: LED统一点亮熄灭接口函数
 * 
 * @参数: 
 * @param: type 0 只亮一下, 1 闪烁, 2 常亮,其他 熄灭
 * @param: interval 闪烁间隔,时间单位100ms(type为1时有效)
 * @param: time 亮的时间 单位1s(0表示永久有效)
 * @返回: 
 * @说明: 
 * @作者: yzy (2013/6/8)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void SYS_LED_BlinkSetAll(uint8 type, uint8 interval, uint8 time);

/************************************************************************
 * @function: SYS_LED_BlinkSet1
 * @描述: LED点亮熄灭接口函数
 * 
 * @参数: 
 * @param: led 操作的LED灯序号
 * @param: type 0 只亮一下, 1 闪烁, 2 常亮,其他 熄灭
 * @param: oninterval 点亮间隔,时间单位100ms(type为1时有效)
 * @param: offinterval 熄灭间隔,时间单位100ms(type为1时有效)
 * @param: time 亮的时间 单位1s(0表示永久有效)
 * @返回: 
 * @说明: 
 * @作者: yzy (2013/6/8)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void SYS_LED_BlinkSet1(LedNo led, uint8 type, uint8 oninterval, uint8 offinterval, uint8 time);


/************************************************************************
 * @function: SYS_LED_BlinkSetAll1
 * @描述: LED统一点亮熄灭接口函数
 * 
 * @参数: 
 * @param: type 0 只亮一下, 1 闪烁, 2 常亮,其他 熄灭
 * @param: oninterval 闪烁间隔,时间单位100ms(type为1时有效)
 * @param: offinterval 熄灭间隔,时间单位100ms(type为1时有效)
 * @param: time 亮的时间 单位1s(0表示永久有效)
 * @返回: 
 * @说明: 
 * @作者: yzy (2013/6/8)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void SYS_LED_BlinkSetAll1(uint8 type, uint8 oninterval, uint8 offinterval, uint8 time);

/************************************************************************
 * @function: SYS_LED_TIMEROC
 * @描述: LED定时器开关函数
 * 
 * @参数: 
 * @param: oc(uint8): true启动, false 停止
 * @返回: 
 * @说明: 
 * @作者: yzy (2013/6/8)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void SYS_LED_TIMEROC(uint8 oc);




#endif

