/****************************************Copyright (c)**************************
**                               	________科技有限公司
**                                     		开发部
**
**
**--------------文件信息--------------------------------------------------------
**文   件   名: dev_hwtimer.h
**创   建   人: yzy
**最后修改日期: 2018年04月28日
**描        述: 实时时钟处理函数配置头文件
**注        意:
**--------------历史版本信息----------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2018年04月28日
** 描　述: 原始版本
*******************************************************************************/

#ifndef _DEV_HWTIMER_H_
#define _DEV_HWTIMER_H_


#ifndef EXT_DEV_HWTIMER
#define EXT_DEV_HWTIMER extern
#endif

/*******************************************************************************
 * @function_name:  SYS_HWTIMER_Init
 * @function_file:  dev_hwtimer.c
 * @描述: 
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2010-02-20)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_HWTIMER_Init(void);

/*******************************************************************************
 * @function_name:  SYS_HWTIMER_Open
 * @function_file:  dev_hwtimer.c
 * @描述: 打开定时器
 * 
 * 
 * @参数: 
 * @param: ch
 * 
 * @返回: 
 * @return:  void   
 * @作者: yzy (2018-03-02)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_HWTIMER_Open(uint8 ch);

/*******************************************************************************
 * @function_name:  SYS_HWTIMER_Close
 * @function_file:  dev_hwtimer.c
 * @描述: 关闭定时器
 * 
 * 
 * @参数: 
 * @param: key
 * 
 * @返回: 
 * @return:  void    
 * @作者: yzy (2018-03-02)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_HWTIMER_Close(uint8 ch);


typedef struct
{
    void (*Init)(void);

    void (*Open)(uint8 ch);
    void (*Close)(uint8 ch);

}_F_HWTIMER;
EXT_DEV_HWTIMER const _F_HWTIMER gs_HwTimer;

#endif
