/****************************************Copyright (c)*************************
**                               	________科技有限公司
**                                     		开发部
**
**
**--------------文件信息-------------------------------------------------------
**文   件   名: dev_gpio.h
**创   建   人: yzy
**最后修改日期: 2010年3月10日
**描        述: 普通输入输出(包括LED输出)端口管理进程函数配置头文件
**注        意:
**--------------历史版本信息---------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2010年3月10日
** 描　述: 原始版本
******************************************************************************/
#ifndef _DEV_GPO_H_
#define _DEV_GPO_H_

#ifndef EXT_DEV_GPO
#define EXT_DEV_GPO extern
#endif 




/*******************************************************************************
 * @function_name:  SYS_GPO_Init
 * @function_file:  dev_gpio.c
 * @描述: GPO设备初始化
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2010-03-11)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_GPO_Init(void);


/*******************************************************************************
** @function_name:  SYS_GPO_Out
** @function_file:  dev_gpio.c
** @描述: GPO端口输出
** 
** 
** @参数: 
** @param: gpo GPO编号
** @param: oc true输出高电平,false输出低电平
** 
** @返回: 
** @作者: yzy (2011-06-23)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
void SYS_GPO_Out(GPOENUM gpo, uint8 oc);

//	typedef struct 
//	{
//	    void (*Init)(void);
//	    void (*Set)(GPOENUM gpo, uint8 oc);
//	}_F_GPO;
//	
//	EXT_DEV_GPO const _F_GPO gs_DEVGpo;

#endif
