/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: dev_msgloop.h
**创   建   人: yzy
**最后修改日期: 2010年11月11日
**描        述: 消息分发机制的头文件
**注        意: 
***--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2010年2月15日
** 描　述: 
********************************************************************************************************/ 
#ifndef _DEV_MSGLOOP_H_
#define _DEV_MSGLOOP_H_

#ifndef EXT_DEV_MSGLOOP
#define EXT_DEV_MSGLOOP extern
#endif


/******************************************************************************
**用户需要申请的消息的种类的寄存器
******************************************************************************/
EXT_DEV_MSGLOOP uint8 guc_MsgApplied[SYS_TK_NUM];
EXT_DEV_MSGLOOP uint8 guc_MsgUartTkMap[NO_OF_SERIAL][SYS_TK_NUM >> 3];


/******************************************************************************
**需要分发的消息类别
******************************************************************************/
//#define MSG_CLS_IN      0x00            //内部通道的消息类别
//#define MSG_CLS_OU      0x01            //外部通道的消息类别
#define MSG_CLS_UART    0x02            //串口消息的消息类别
#define MSG_CLS_GPIO    0x03            //GPIO的消息类别    
#define MSG_CLS_TM      0x04            //时间组建的消息类别
#define MSG_CLS_MD      0x05            //Modem通道的消息类别
#define MSG_CLS_ETH     0x06            //以太网通道的消息



/*******************************************************************************
* @function_name:  SYS_MSG_Init
* @function_file:  dev_messageloop.c
* @描述: 消息分配管理初始化
* 
* 
* @参数: 
* 
* @返回: 
* @作者: yzy (2011-02-24)
*-----------------------------------------------------------------------------
* @修改人: 
* @修改说明: 
******************************************************************************/
void SYS_MSG_Init(void);

/*******************************************************************************
* @function_name:  SYS_MSG_Apply
* @function_file:  dev_messageloop.c
* @描述: 申请消息
* 
* 
* @参数: msgcls消息类别
* 
* @返回:  
* @作者: yzy (2011-02-24)
******************************************************************************/
uint8 SYS_MSG_Apply(uint32 tkid, uint8 msgcls);

/*******************************************************************************
* @function_name:  SYS_MSG_ApplyUartRecv
* @function_file:  dev_messageloop.c
* @描述: 申请消息(扩充函数)
* 
* 
* @参数: msgcls 消息大类
*        subcls 消息小类,当大类为串口消息时,小类为串口号
* @返回:  
* @作者: yzy (2011-02-24)
******************************************************************************/
uint8 SYS_MSG_ApplyExt(uint8 tkid, uint8 msgcls, uint8 subcls);


#endif







