/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: dev_system.h
**创   建   人: yzy
**最后修改日期: 2018年3月7日
**描        述: 系统设备
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2018年3月7日
** 描　述: 原始版本
********************************************************************************************************/


#ifndef _EXT_DEV_SYSTEM_H_
#define _EXT_DEV_SYSTEM_H_



typedef struct
{
    TDevConst devc;
    void (*EnterLPC)(void);
    void (*SetTime)(TIME* datetime);
    void (*GetTime)(TIME* datetime);
    void (*FeedDOG)(void);
    void (*OpenSWDOG)(uint8);
    void (*Reset)(void);

}TDevSys;


/***********************************************************
 * @function_name: DEV_SysInit
 * @function_file: freq.c
 * @描述:将基本系统作为一个设备访问
 * 
 * @参数: 
 * @返回: 
 * @作者:
 *---------------------------------------------------------
 * @修改人: houpm (2010/2/18)
 **********************************************************/
void DEV_SysInit(void);

#endif









