/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: dev_valve.h
**创   建   人: yzy
**最后修改日期: 2018年4月25日
**描        述: 阀门驱动模块的头文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2018年4月25日
** 描　述: 原始版本
********************************************************************************************************/
#ifndef _DEV_VALVE_H_
#define _DEV_VALVE_H_


#ifndef EXT_DEV_VALVE
#define EXT_DEV_VALVE extern
#endif

typedef enum
{
    eHWStatus_VALVE_UNKNOW,
    eHWStatus_VALVE_CLOSED,
    eHWStatus_VALVE_CLOSING,
    eHWStatus_VALVE_OPEN,
    eHWStatus_VALVE_OPENING,
}eHWStatus;


/*******************************************************************************
 * @function_name:  SYS_VALVE_Init
 * @function_file:  dev_valve.c
 * @描述: 阀门初始化
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2018-04-25)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_VALVE_Init(void);
/*******************************************************************************
 * @function_name:  SYS_VALVE_Close
 * @function_file:  dev_valve.c
 * @描述: 关闭阀门
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2018-04-25)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_VALVE_Close(void);

/*******************************************************************************
 * @function_name:  SYS_VALVE_Open
 * @function_file:  dev_valve.c
 * @描述: 开启阀门
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2018-04-25)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_VALVE_Open(void);

/*******************************************************************************
 * @function_name:  SYS_VALVE_Status_Get
 * @function_file:  dev_valve.c
 * @描述: 获取阀门
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2018-04-25)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
eHWStatus SYS_VALVE_Status_Get(void);

typedef struct 
{
    void (*Init)(void);
    void (*Open)(void);
    void (*Close)(void);
    eHWStatus (*getStat)(void);
}_F_VALVE;

EXT_DEV_VALVE const _F_VALVE gs_DEVValve;

#endif
