/****************************************Copyright (c)**************************
**                               	________科技有限公司
**                                     		开发部
**
**
**--------------文件信息--------------------------------------------------------
**文   件   名: realtime.h
**创   建   人: yzy
**最后修改日期: 2018年04月28日
**描        述: 实时时钟处理函数配置头文件
**注        意:
**--------------历史版本信息----------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2018年04月28日
** 描　述: 原始版本
*******************************************************************************/

#ifndef _REALTIME_H_
#define _REALTIME_H_


#ifndef EXT_DEV_REALTIME
#define EXT_DEV_REALTIME extern
#endif




/******************************************************************************
**外部应用对该模块操作时的操作码
******************************************************************************/
enum
{
    HRTC_RW_RB = 0,                         //读取BCD格式时间
    HRTC_RW_RH = 1,                         //读取HEX格式时间
    HRTC_RW_WB = 2,                         //写入BCD格式时间
    HRTC_RW_WH = 3,                         //写入HEX格式时间
};






/******************************************************************************
**终端持续运行时间
**(外部应用请使用GetSysRunSecs接口函数,2015-01-27)
******************************************************************************/
EXT_DEV_REALTIME uint32 gul_SysRunSecs;


/*******************************************************************************
 * @function_name:  SYS_RTC_Init
 * @function_file:  realtime.c
 * @描述: 
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2010-02-20)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_RTC_Init(void);


/*******************************************************************************
 * @function_name:  SYS_MCU_ReadBCDDateTime
 * @function_file:  realtime.c
 * @描述: 读取ARM的时间,格式BCD
 * 
 * @参数: 
 * @param: tm(TIME*): 时间结构体缓存
 * @返回: 
 * @作者: yzy (2010-11-16)
 ******************************************************************************/
uint8 SYS_MCU_ReadBCDDateTime(TIME * datetime);



/*******************************************************************************
 * @function_name:  SYS_MCU_ReadDateTime
 * @function_file:  realtime.c
 * @描述: 读取ARM的时间,格式HEX
 * 
 * @参数: 
 * @param: tm(TIME*): 时间结构体缓存
 * @返回: 
 * @作者: yzy (2010-11-16)
 ******************************************************************************/
uint8 SYS_MCU_ReadDateTime(TIME* datetime);

/*******************************************************************************
 * @function_name:  SYS_MCU_WriteDateTime
 * @function_file:  dev_realtime.c
 * @描述: 设置ARM RTC时间
 * 
 * 
 * @参数: 
 * @param: datetime 时间结构体,其中的秒,分,时,周,日,月,年必须正确
 * 
 * @返回: 
 * @return:  uint8   
 * @作者: yzy (2011-02-21)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
uint8 SYS_MCU_WriteDateTime(TIME* datetime);

/*******************************************************************************
 * @function_name:  SYS_MCU_WriteBCDDateTime
 * @function_file:  dev_realtime.c
 * @描述: 设置ARM RTC时间(BCD格式)
 * 
 * 
 * @参数: 
 * @param: datetime 时间结构体BCD格式,其中的秒,分,时,周,日,月,年必须正确
 * 
 * @返回: 
 * @return:  uint8   
 * @作者: yzy (2011-02-21)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
uint8 SYS_MCU_WriteBCDDateTime(TIME* datetime);

/*******************************************************************************
 * @function_name:  SYS_HRTC_WriteDateTime
 * @function_file:  realtime.c
 * @描述: 设置外部RTC的时间,格式HEX
 * 
 * @参数: 
 * @param: tm(TIME*): 时间结构体缓存
 * @返回: 
 * @作者: yzy (2010-11-16)
 ******************************************************************************/
uint8 SYS_WriteDateTime(TIME* datetime);

/*******************************************************************************
 * @function_name:  SYS_HRTC_ReadDateTime
 * @function_file:  realtime.c
 * @描述: 读取外部RTC的时间,格式HEX
 * 
 * @参数: 
 * @param: tm(TIME*): 时间结构体缓存
 * @返回: 
 * @作者: yzy (2010-11-16)
 ******************************************************************************/
uint8 SYS_ReadDateTime(TIME* datetime);

/*******************************************************************************
 * @function_name:  SYS_HRTC_ReadDateTime
 * @function_file:  realtime.c
 * @描述: 读取外部RTC的时间,格式BCD 
 * @参数: 
 * @param: tm(TIME*): 时间结构体缓存
 * @返回: 
 * @作者: yzy (2010-11-16)
 ******************************************************************************/
uint8 SYS_ReadBCDDateTime(TIME* datetime);

/*******************************************************************************
 * @function_name:  SYS_HRTC_ReadDateTime
 * @function_file:  realtime.c
 * @描述: 设置外部RTC的时间,格式BCD
 * @参数: 
 * @param: tm(TIME*): 时间结构体缓存
 * @返回: 
 * @作者: yzy (2010-11-16)
 ******************************************************************************/
uint8 SYS_WriteBCDDateTime(TIME* datetime);

/*******************************************************************************
 * @function_name:  GetTime
 * @function_file:  realtime.c
 * @描述: 获取当前的时间和日期的全部信息, 这个信息只读
 * 
 * 
 * @参数: 
 * @param: 
 * @返回: 
 * @作者: yzy (2010-02-20)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
const TIME* GetTime(void);

/*******************************************************************************
 * @function_name:  GetSysRunSecs
 * @function_file:  realtime.c
 * @描述: 获取系统连续运行时间
 * 
 * 
 * @参数: 
 * @param: 
 * @返回: 当前系统运行总秒数
 * @作者: yzy (2010-02-20)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
uint32 GetSysRunSecs(void);
void SYS_RTC_Start(void);

#endif

