/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: dev_fls.h
**创   建   人: yzy
**最后修改日期: 2018年2月20日
**描        述: 设备flash+铁电
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2018年2月20日
** 描　述: 原始版本
********************************************************************************************************/

#ifndef _DEV_FLS_H_
#define _DEV_FLS_H_

#ifndef EXT_DEV_FLS
#define EXT_DEV_FLS extern
#endif 







/************************************************************************
 * @function: SYS_VFRAM_WriteSample
 * @描述: 向一个条目中写入数据
 * 
 * @参数: 
 * @param: data 欲写入的内容
 * @param: num 铁电条目编号
 * @param: finfo 条目信息结构体
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2011-2-25)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 SYS_VFRAM_WriteSample(uint8* data, uint16 num, const TFlsCycleConst* finfo);


/************************************************************************
 * @function: SYS_VFRAM_ReadSample
 * @描述: 读取一个条目数据
 * 
 * @参数: 
 * @param: data 一个条目,大小至少为单个条目的字节长度,否则会导致缓存溢出
 * @param: num 条目编号
 * @param: finfo 条目信息结构体
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2013/11/2)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 SYS_VFRAM_ReadSample(uint8* data, uint16 num, const TFlsCycleConst* finfo);


/************************************************************************
 * @function: SYS_VFRAM_IsConfigLegal
 * @描述: 判断铁电配置的合法性
 * 
 * @参数: 
 * @param: 
 * 
 * @返回: 
 * @return: uint8  0合法,其他非法
 * @说明: 
 * @作者: yzy (2013/11/2)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 SYS_VFRAM_IsConfigLegal(const TFlsCycleConst* finfo);

#endif

