
#include "public.h"


/*******************************************************************************
**数据的地址及属性
*******************************************************************************/
const CDATAAddr gss_CDATAAddrExt[] =
{
  
/*******************************************************************************
**afn=0x0C 请求类数据
*******************************************************************************/

    //以下disp.c中使用
    {
        0xA100,                         //终端地址
        0xF3,
        0,
        (uint32)gs_PstPara.Addr,
    },
  
};
const uint16 gui_CoreAddrExtTblSize = sizeof(gss_CDATAAddrExt) / sizeof(CDATAAddr);


