/****************************************Copyright (c)**************************************************
**                                  ____科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: inp.h
**创   建   人: yzy
**最后修改日期: 2007年9月5日
**描        述: 
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2007年9月5日
** 描　述: 原始版本
********************************************************************************************************/

#ifndef _INP_H_
#define _INPP_H_


#ifndef EXT_INP
#define EXT_INP extern
#endif


typedef struct
{
    uint8 seft;
    uint8 deft;
}S_EFT_MAP;




/************************************************************************
 *
 ************************************************************************/
typedef struct
{
    uint8 segno;
    uint16 seglen;
}S_DATASEGINFO;




/************************************************************************
 * @function: SA_REALDATA_Write
 * @描述: 向一个虚拟条目中写入数据(FLASH当内存用)
 * 
 * @参数: 
 * @param: data 欲写入的内容
 * @param: tno 测量点号
 * @param: type 数据类型 0:实时事件数据,1:实时需量数据,3:电压采样
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 SA_REALDATA_Write(uint8* data, uint16 tno, uint8 type);


/************************************************************************
 * @function: SA_REALDATA_Read
 * @描述: 从一个虚拟内存条目中读取数据(FLASH当内存用)
 * 
 * @参数: 
 * @param: data 存放数据的缓存
 * @param: tno 测量点号
 * @param: type 数据类型 0:实时事件数据,1:实时需量数据,3:电压采样
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/8)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 SA_REALDATA_Read(uint8* data, uint16 tno, uint8 type);


/************************************************************************
 * @function: MapEft
 * @描述: 根据一个有效性数组去建立另一个有效性数组
 * 
 * @参数: 
 * @param: s 源数组
 * @param: d 目标数组
 * @param: s_map 对应结构体
 * @param: s_len 对应结构体项数
 * @返回: 
 * @说明: 
 * @作者: yzy (2011-9-21)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void MapEft(uint8* s, uint8* d, S_EFT_MAP* s_map, uint8 s_len);

/************************************************************************
 * @function: gdw_CrackRecData
 * @描述: 清空表日数据
 * 
 * @参数: 
 * @param:  
 * @返回: 
 * @说明: 
 * @作者: yzy (2014/2/15)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void gdw_CrackRecData(void);

/************************************************************************
 * @function: gdw_SaveRecData
 * @描述: 冻结某端口下的测量点抄表日数据
 * 
 * @参数: 
 * @param: port 端口索引
 * @param: segno 段号
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/15)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_SaveRecData(uint8 port, uint8 segno);


/************************************************************************
 * @function: gdw_ReadRecData
 * @描述: 获取某个测量点的抄表日数据
 * 
 * @参数: 
 * @param: time 年月日
 * @param: tno 测量点号
 * @param: segno 端口号
 * @param: outbuffer 输出缓存
 * 
 * @返回: 
 * @return: uint8 成功/失败
 * @说明: 
 * @作者: yzy (2014/2/15)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_ReadRecData(uint8* time, uint8 tno, uint8 segno, uint8* outbuffer);




/************************************************************************
 * @function: _DayDataAddr
 * @描述: 日冻结数据起始地址
 * 
 * @参数: 
 * @param: ymd 输入,时间
 * @param: tno 输入,测量点号
 * @param: segno 输入,段号
 * @param: outinfo 输出,段信息
 * @param: outbidx 输出,位图索引
 * 
 * @返回: 
 * @return: uint32  
 * @说明: 
 * @作者: yzy (2014/2/16)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint32 _DayDataAddr(uint8* ymd, uint8 tno, uint8 segno, const S_DATASEGINFO** outinfo, uint16* outbidx);

/************************************************************************
 * @function: gdw_CrackDayData
 * @描述: 清空日冻结数据
 * 
 * @参数: 
 * @param: 
 * @返回: 
 * @说明: 
 * @作者: yzy (2011-9-21)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void gdw_CrackDayData(void);

/************************************************************************
 * @function: gdw_SaveTstDayData
 * @描述: 将某个测量点的实时数据冻结为上日日数据
 * 
 * @参数: 
 * @param: tno 测量点号
 * @param: segno 段号
 * 
 * @返回: 
 * @return: uint8  成功/失败
 * @说明: 
 * @作者: yzy (2014/2/16)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_SaveTstDayData(uint8 tno, uint8 segno);

/************************************************************************
 * @function: gdw_SaveDayData
 * @描述: 冻结某端口下的测量点日数据
 * 
 * @参数: 
 * @param: port 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2011-9-21)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_SaveDayData(uint8 port);




/************************************************************************
 * @function: gdw_ReadDayData
 * @描述: 获取某个测量点的日数据
 * 
 * @参数: 
 * @param: time 年月日
 * @param: tno 测量点号
 * @param: segno 段号
 * @param: outbuffer 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/16)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_ReadDayData(uint8* time, uint8 tno, uint8 segno, uint8* outbuffer);



/************************************************************************
 * @function: gdw_CrackMonthData
 * @描述: 清空月冻结数据
 * 
 * @参数: 
 * @param: 
 * @返回: 
 * @说明: 
 * @作者: yzy (2011-9-21)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void gdw_CrackMonthData(void);


/************************************************************************
 * @function: _MonthDataAddr
 * @描述: 月冻结数据起始地址
 * 
 * @参数: 
 * @param: ym  输入,时间
 * @param: tno 输入,测量点号
 * @param: segno 输入,段号
 * @param: outinfo 输出,段信息
 * @param: outbidx 输出,位图索引
 * 
 * @返回: 
 * @return: uint32  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint32 _MonthDataAddr(uint8* ym, uint8 tno, uint8 segno, const S_DATASEGINFO** outinfo, uint16* outbidx);
/************************************************************************
 * @function: gdw_SaveMonthData
 * @描述: 冻结某端口下的测量点上月数据
 * 
 * @参数: 
 * @param: port 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_SaveMonthData(uint8 port);



/************************************************************************
 * @function: gdw_ReadMonthData
 * @描述: 获取某个测量点的月数据
 * 
 * @参数: 
 * @param: time 年月
 * @param: tno 测量点号
 * @param: segno 段号
 * @param: outbuffer 输出缓存
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_ReadMonthData(uint8* time, uint8 tno, uint8 segno, uint8* outbuffer);




/************************************************************************
 * @function: gdw_CrackHourData
 * @描述: 清空小时冻结数据
 * @参数: 
 * @返回: 
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void gdw_CrackHourData(void);


/************************************************************************
 * @function: gdw_SaveHourData
 * @描述: 冻结某端口下的测量点小时数据
 * 
 * @参数: 
 * @param: port 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_SaveHourData(uint8 port);


/************************************************************************
 * @function: gdw_ReadHourData
 * @描述: 获取某个测量点的小时数据
 * 
 * @参数: 
 * @param: time 年月日时分
 * @param: tno 测量点号
 * @param: segno 段号
 * @param: outbuffer 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_ReadHourData(uint8* time, uint8 tno, uint8 segno, uint8* outbuffer);



/************************************************************************
 * @function: gdw_SaveCureData
 * @描述: 存储曲线数据(间隔15分钟)
 * @参数: 
 * @param: time 年月日时分秒
 * @param: tno 测量点号
 * @param: outbuffer 输出缓存
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: zjc (2014/8/19)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_SaveCureData(uint8* time, uint8 tno, uint8* outbuffer);

/************************************************************************
 * @function: gdw_ReadCureData
 * @描述: 读取曲线数据
 * 
 * @参数: 
 * @param: time 年月日时分
 * @param: outbuffer 输出缓存
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 暂不带位图,总清不清除
 * @作者: ZJC (2014/8/19)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_ReadCureData(uint8* time, uint8 tno, uint8* outbuffer);
/************************************************************************
 * @function: gdw_CrackCureData
 * @描述: 清空曲线数据
 * 
 * @参数: 
 * @param: 
 * @返回: 
 * @说明: 
 * @作者: zjc (2014-8-24)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void gdw_CrackCureData(void);
/************************************************************************
 * @function: gdw_SaveQuarData
 * @描述: 存储分平均电压数据(间隔15分钟)
 * @参数: 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_SaveQuarData(void);



/************************************************************************
 * @function: gdw_ReadQuarData
 * @描述: 读取存储的分平均电压
 * 
 * @参数: 
 * @param: time 年月日时分
 * @param: quardata 输出缓存
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_ReadQuarData(uint8* time, S_QUARDATA_SEG0* quardata);



/************************************************************************
 * @function: Netp_State
 * @描述: 更新状态
 * 
 * @参数: 
 * @param: pdata 
 * @返回: 
 * @说明: 
 * @作者: zgb(12-01-10)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void Netp_State(void* pdata);



/************************************************************************
 * @function: gdw_SaveTstDayStat
 * @描述: 存储测量点电压统计日数据
 * @参数: 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_SaveTstDayStat(void);


/************************************************************************
 * @function: gdw_ReadTstDayState
 * @描述: 存储测量点电压统计日数据
 * 
 * @参数: 
 * @param: time 年月日
 * @param: tno 测量点号
 * @param: voldata 输出缓存
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_ReadTstDayStat(uint8* time, uint8 tno, S_CBVOL_SEG0* voldata);


/************************************************************************
 * @function: gdw_SaveTstMonthStat
 * @描述: 存储测量点电压统计月数据
 * @参数: 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_SaveTstMonthStat(void);


/************************************************************************
 * @function: gdw_ReadTstMonthStat
 * @描述: 读取测量点电压统计月数据
 * 
 * @参数: 
 * @param: time 
 * @param: tno 
 * @param: voldata 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/2/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 gdw_ReadTstMonthStat(uint8* time, uint8 tno, S_CBVOL_SEG0* voldata);





/************************************************************************
**函数名称: void Inp_DataClear(void)
**描 述: 数据总清函数
**
**输 入: 
**输 出: 
**
**备 注: 
**--------------------------------------------------------
**作 者: yzy
**日 期: 2009-09-09
*************************************************************************/
void Inp_DataClear(void);




#endif





