/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: pst_zy.c
**创   建   人: yzy
**最后修改日期: 2019年6月18日
**描        述: 通讯模块____规约处理文件包括主动通讯和被动通讯
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2019年6月18日
** 描　述: 原始版本
********************************************************************************************************/
#define EXT_MODBUS


/************************************************************************
 * @function: PST_MODBUS_Pack
 * @描述: 对modbus协议帧进行打包,主动通讯
 * 
 * @参数: 
 * @param: frame 打包的结构体
 * @param: err 
 * @param: length 输入为打包缓存的最大长度,输出为打包好之后的长度
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/5/27)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/

uint8 PST_MB_Pack(PST_Frame* frame, uint8 err, uint16* length);
/************************************************************************
 * @function: PST_MB_Proc
 * @描述: 
 * 
 * @参数: 
 * @param: frm 数据解析成的结构体
 * 
 * @返回: 
 * @return: uint8  PST_ERR_OK/PST_ERR_FT
 * @说明: 
 * @作者: yzy (2014/5/27)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 PST_MB_Proc(PST_Frame* frm);
/************************************************************************
 * @function: PST_MB_Decode
 * @描述: 判断当前缓存里面是否为合法帧,如果是的话则解析成为被动通讯结构体
 * 
 * @参数: 
 * @param: receive 接收到数据的缓存
 * @param: send 需要发送的数据的缓存
 * @param: sbuflen 发送缓存长度
 * @param: frame 数据解析成的结构体
 * 
 * @返回: 
 * @return: uint8  PST_ERR_OK/PST_ERR_FT
 * @说明: 
 * @作者: yzy (2013/7/16)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 PST_MB_Decode(uint8* receive, uint8* send, uint16 sbuflen, PST_Frame* frame);



