/****************************************Copyright (c)**************************************************
**                                  ____科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: pst_bg.h
**创   建   人: yzy
**最后修改日期: 2017年9月1日
**描        述: 被动通讯模块645规约处理文件的头文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2017年9月1日
** 描　述: 原始版本
********************************************************************************************************/

#ifndef _PST_VS_H_
#define _PST_VS_H_

//	#define RAM_BG_END  RAM_BG_START
//	#define ROM_BG_END  ROM_BG_START
#ifndef EXT_PSTZY
#define EXT_PSTZY extern
#endif

extern const uint8 gucs_VSALLAddr[][6];

/******************************************************************************
**函数类型声明
******************************************************************************/
typedef void (*fHdlcProc)(uint8* data, uint32 len, uint8 module);
typedef void (*fBgProc)(uint8* data, uint32 len);
typedef void (*fDlmsProc)(uint8* data, uint32 len);
/************************************************************************ 
**启动帧的帧计数器:pseq
*************************************************************************/
EXT_PSTZY uint8 guc_pseq;

/************************************************************************ 
**响应帧的帧计数器:rseq
*************************************************************************/
EXT_PSTZY uint8 guc_rseq;

/*********************************************************************************************************
**函数名称  uint8 BG_Decode(uint8* receive, PST_Frame* frm, uint8* addr)
**输入  receive 接收到数据的缓存        
        code    数据解析成的结构体
        addr    需要回复的表地址
**输出  PST_ERR_OK
**      PST_ERR_FT
**说明  主动接收到的部规帧的解包函数
** 全局变量:
** 调用模块:
**
**------------------------------------------------------------------------------------------------------
** 作  者: yzy
** 日　期: 2017年9月1日
** 内  容: 
********************************************************************************************************/
uint8 VS_Decode(uint8* receive, DLT_Frame* frm, uint8* addr);


/*********************************************************************************************************
**函数名称  uint8 BG_Pack(PST_Frame* frm, uint8* addr, uint16* length)
**输入  frm 打包的结构体
        addr 打包的地址            
        length 输入为打包缓存的最大长度，输出为打包好之后的长度
**输出  PST_ERR_OK
        PST_ERR_VAR
**      PST_ERR_FT
**说明  对645帧进行打包，主动通讯
** 全局变量:
** 调用模块:
**
**------------------------------------------------------------------------------------------------------
** 作  者: yzy
** 日　期: 2017年9月1日
** 内  容: 
********************************************************************************************************/
uint8 VS_Pack(DLT_Frame* frm, uint8* addr, uint16* length);

/*********************************************************************************************************
**函数名称  uint8 XBG_Pack(PST_Frame* frm, uint8* addr, uint16* length)
**输入  frm 打包的结构体
        addr 打包的地址            
        length 输入为打包缓存的最大长度,输出为打包好之后的长度
**输出  PST_ERR_OK
        PST_ERR_VAR
**      PST_ERR_FT
**说明  对645-2007帧进行打包,主动通讯
** 全局变量:
** 调用模块:
**
**------------------------------------------------------------------------------------------------------
** 作  者: yzy
** 日　期: 2018年3月22日
** 内  容: 针对645-2007的打包
********************************************************************************************************/
uint8 XVS_Pack(DLT_Frame* frm, uint8* addr, uint16* length);

/*********************************************************************************************************
**函数名称  uint8 PST_BG_Decode(uint8* receive, uint8* send, PST_Frame* code)
**输入  receive 接收到数据的缓存
        send    需要发送的数据的缓存
        code    数据解析成的结构体
**输出  PST_ERR_OK
**      PST_ERR_FT
**说明  判断当前缓存里面是否为合法帧、如果是的话则解析成为被动通讯结构体
** 全局变量:
** 调用模块:
**
**------------------------------------------------------------------------------------------------------
** 作  者: yzy
** 日　期: 2017年9月1日
** 内  容: 
********************************************************************************************************/
uint8 PST_VS_Decode(uint8* receive, uint8* send, uint16 sbuflen, PST_Frame* frame);


/*********************************************************************************************************
**函数名称  uint8 PST_BG_Proc(PST_Frame* frm)
**输入  
        code    数据解析成的结构体
**输出  PST_ERR_OK
**      PST_ERR_FT
**说明  将数据透明转发给内部
** 全局变量:
** 调用模块:
**
**------------------------------------------------------------------------------------------------------
** 作  者: yzy
** 日　期: 2017年9月1日
** 内  容: 
********************************************************************************************************/
uint8 PST_VS_Proc(PST_Frame* frm);

#endif


