/****************************************Copyright (c)**************************************************
**                                  ____科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: core.h
**创   建   人: yzy
**最后修改日期: 2007年9月6日
**描        述: 配变程序内部通讯端口的通用程序的头文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2007年9月6日
** 描　述: 原始版本
********************************************************************************************************/

#ifndef _CORE_H_
#define _CORE_H_

#ifndef EXT_CORE
#define EXT_CORE extern
#endif



#define TST_PFID_IDLE       0   //0：表示终端无需对本序号的电能表装置进行抄表；
#define TST_PFID_DLT97      1   //1：DL/T 645—1997.；
#define TST_PFID_AC         20   //2：表示交流采样装置通讯协议；
#define TST_PFID_DLT07      30   //30：DL/T 645—2007；
#define TST_PFID_HX_DLMS    50   //50：DLMS通信规约，
#define TST_PFID_HX_645     52   //52：HX645规约，
#define TST_PFID_ABNT       53   //53：ABNT规约，
#define TST_PFID_HX_MODBUS  54   //54：海兴MODBUS协议,
#define TST_PFID_HX_21      55   //55：海兴21通信规约，
#define TST_PFID_HX_ANSI    56   //56：海兴ANSI通信规约，
#define TST_PFID_ACT_DLMS   80   //80：为ACTARIS-DLMS通信规约，
#define TST_PFID_EDMI       90   //90：为MK6E-EDMI规约，





/*********************************************************************
**定义测量点参数结构
参见附件2 - 4.3.3 标识编码表B
ls: D0 D1表示测量点数据位.00 8数据位, 01 7数据位
      D2 D3表示测量点校验位, 00 无校验, 01 偶校验, 02 奇校验 
      D4 D5表示停止位, 00 1停止位, 01 2停止位
**********************************************************************/

typedef struct
{
    STMeterInfo info;
    uint8 pf;                           //测量点协议
    uint8 dicfg;                        //抄读项配置(D4-D7大类号,D0-D3小类号)
    uint8 bs;                           //通讯波特率,实际值/300
    uint8 pt;                           //内部端口号(0-3)
    uint8 us[32];   //通信用户名
    uint8 pw[32];   //通信密码
}CDATATst;
//	typedef struct
//	{
//	    uint8 ef;                           //有效标志
//	    uint8 tf;                           //测量点性质(1.485表,5.交流采样)
//	    uint8 pf;                           //测量点规约(1.645-97,3.645-07,5.HX-DLMS)
//	    uint8 dicfg;                        //抄读项配置(D4-D7大类号,D0-D3小类号)
//	    uint8 ad[6];                        //测量点通讯地址
//	    uint8 bs;                           //通讯波特率,实际值/300
//	    uint8 fl;                           //测量点费率
//	    uint8 pt;                           //内部端口号(0-2)
//	    uint8 us[32];   //通信用户名
//	    uint8 pw[32];   //通信密码
//	}CDATATst;


/*********************************************************************
**定义测量点参数
**********************************************************************/
EXT_CORE CDATATst gss_CDATATst[CORE_TST_NO];



#define CDATA_ERR_TT    (uint8)0x10
#define CDATA_ERR_DI    (uint8)0x11
#define CDATA_ERR_LEN   (uint8)0x12
#define CDATA_ERR_BT    (uint8)0x13

/*******************************************************************
**核心处理表的单元结构
********************************************************************/
#ifndef _DEF_CDATA
#define _DEF_CDATA
typedef struct strcdata
{
    uint16 id;                          //内核标识
    uint16 nslm;                        //同类项数 最高比特位1 表示存在同类项
    uint16 tatr;                        //测量点属性 0x7F:所有
    uint16 len;                         //数据单元长度
    uint8 (*proc)(uint16, uint16, uint8*, const struct strcdata*, bool);
//    uint32 proc;                        //数据单元处理方式    
    
}CDATA;
#endif


#define CORE_TATR_TM    0x0001          //终端
#define CORE_TATR_MT    0x0002          //表记
#define CORE_TATR_TG    0x0004          //集中器
#define CORE_TATR_SM    0x0008          //模拟量
#define CORE_TATR_PS    0x0010          //脉冲量
#define CORE_TATR_AC    0x0020          //交流采样
#define CORE_TATR_CA    0x0040          //计算量
#define CORE_TATR_LD    0x0080          //漏电保护器

/*******************************************************************
**地址空间定位表格
********************************************************************/
#ifndef _DEF_CDATAADDR
#define _DEF_CDATAADDR
typedef struct
{
    uint16 id;                          //数据标识
    uint8 type;                         //寻址方式     
                                        //00-240flash,241铁电,242 FarRAM,243 内部内存
    uint8 atr;                          //属性, 1个测量点所有数据长度/64
    uint32 addr;                        //偏移地址
}CDATAAddr;
#endif

#define CORE_ADR_ATRT   0x80            //表示相对地址还和测量点号相关





/*******************************************************************
**内核表和部规之间的转换结构表
********************************************************************/
#ifndef _DEF_CDATATOBG
#define _DEF_CDATATOBG
typedef struct
{
    uint16 cid;                         //内核标识
    uint32 bgid;                        //部规标识
    void* proc;                         //处理方式
}CDATAToBG;
#endif





/*******************************************************************
**内核表独立处理函数
********************************************************************/
#ifndef _DEF_CDATAFUNC
#define _DEF_CDATAFUNC
typedef struct
{
    uint16 cid;
    uint16 atr;
    uint8 (*func)(uint16, uint16, uint8*, const CDATA*);
}CDATAFunc;
#endif




/*********************************************************************************************************
** 函数名称: uint16 TSTP_GetType(uint8 tstno)
** 功能描述: 获取测量点性质
** 输　入:  tstno: 测量点号
** 输　出:  测量点类型性质
**
** 全局变量: 无
** 调用模块: 无
**
** 作　者: yzy
** 日　期: 2007年11月7日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
uint16 TSTP_GetType(uint8 tstno);

/*********************************************************************************************************
** 函数名称: uint8 CDATA_Read(uint16 id, uint16 tstp, uint8* buffer, uint16* len)
** 功能描述: 通过内核表读取数据
** 输　入:  id 数据标识
            tstp bit0 - bit5 测量点号 bit6-bit15 同类项数
            buffer 读取数据的缓存
            len 输入时表示缓存的最大长度，输出时表示读取数据的长度
** 输　出: 无
**
** 全局变量: 无
** 调用模块: 无
**
** 作　者: yzy
** 日　期: 2007年9月6日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/

uint8 CDATA_Read(uint16 id, uint16 tstp, uint8* buffer, uint16* len);


/*********************************************************************************************************
** 函数名称: uint8 CDATA_Write(uint16 id, uint16 tstp, uint8* buffer, uint16 len)
** 功能描述: 通过内核表写入数据
** 输　入:  id 数据标识
            tstp bit0 - bit5 测量点号 bit6-bit15 同类项数
            buffer 写入数据的缓存
            len 表示要写入的数据的长度
** 输　出: 无
**
** 全局变量: 无
** 调用模块: 无
**
** 作　者: yzy
** 日　期: 2007年9月6日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
uint8 CDATA_Write(uint16 id, uint16 tstp, uint8* buffer, uint16 len);

/*********************************************************************************************************
** 函数名称: const CDATA* CDATA_GetInfo(uint16 id)
** 功能描述: 根据内核数据标识，获取内核表的一项内容
** 输　入:  id 数据标识            
** 输　出: 无
**
** 全局变量: 无
** 调用模块: 无
**
** 作　者: yzy
** 日　期: 2007年9月14日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
const CDATA* CDATA_GetInfo(uint16 id);

/*********************************************************************************************************
** 函数名称: const CDATAToBG* CDATA_SearchBgDI(uint16 DI)
** 功能描述: 查找内核数据标识对应的部规标识
** 输　入: DI: 内核数据标识
** 输　出: 对应数据标识的结构体信息指针
**
** 全局变量: 无
** 调用模块: 无
**
** 作　者: yzy
** 日　期: 2007年10月15日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
const CDATAToBG* CDATA_SearchBgDI(uint16 DI);

/*********************************************************************************************************
** 函数名称: uint8 CDATA_SelfSelectR(uint16 id, uint16 tstp, uint8* buffer, const CDATA* cd)
** 功能描述: 通过通讯读取数据
** 输　入:  id 数据标识
            tstp bit0 - bit5 测量点号 bit6-bit15 同类项数
            buffer 读取数据的缓存
            cd 内核表中的一项内容
** 输　出: 无
**
** 全局变量: 无
** 调用模块: 无
**
** 作　者: yzy
** 日　期: 2007年9月6日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
uint8 CDATA_SelfSelectR(uint16 id, uint16 tstp, uint8* buffer, const CDATA* cd, bool oc);

/*********************************************************************************************************
** 函数名称: uint8 CDATA_DirecAddrProc(uint16 id, uint16 tstp, uint8* buffer, const CDATA* cd, 
uint8 type)** 功能描述: Flash地址直接操作
** 输　入:  id 数据标识
**          tstp bit0 - bit5 测量点号 bit6-bit15 同类项数
**          buffer 读取数据的缓存
**          cd 内核表中的一项内容
**          oc 读写属性 true 读 false 写
** 输　出:  测量点类型性质
**
** 全局变量: 无
** 调用模块: 无
**
** 作　者: yzy
** 日　期: 2007年11月7日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
uint8 CDATA_DirecAddrProc(uint16 id, uint16 tstp, uint8* buffer, const CDATA* cd, bool oc);

/*********************************************************************************************************
** 函数名称: uint8 CDATA_FunctionR(uint16 id, uint16 tstp, uint8* buffer, const CDATA* cd)
** 功能描述: 通过函数来操作数据
** 输　入:  id 数据标识
            tstp bit0 - bit5 测量点号 bit6-bit15 同类项数
            buffer 读取数据的缓存
            cd 内核表中的一项内容
** 输　出: 无
**
** 全局变量: 无
** 调用模块: 无
**
** 作　者: yzy
** 日　期: 2007年9月15日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
uint8 CDATA_FunctionR(uint16 id, uint16 tstp, uint8* buffer, const CDATA* cd, bool oc);

/*********************************************************************************************************
** 函数名称: uint8 ADATA_FunctionW(uint16 id, uint16 tstp, uint8* buffer, const CDATA* cd)
** 功能描述: 通过函数来操作数据
** 输　入:  id 数据标识
            tstp bit0 - bit7长度
            buffer 读取数据的缓存
            cd 内核表中的一项内容
** 输　出: 无
**
** 全局变量: 无
** 调用模块: 无
**
** 作　者: yzy
** 日　期: 2007年9月15日
**-------------------------------------------------------------------------------------------------------
** 修改人:
** 日　期:
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
uint8_t ADATA_FunctionW(uint16_t id, uint16_t tstp, uint8_t* buffer, uint8_t* data);


#ifndef _DEF_ADATAFUNC //A--analytical  自解析
#define _DEF_ADATAFUNC
typedef struct
{
    uint16_t cid;
    uint16_t atr;
    uint8 (*func)(uint16_t, uint16_t, uint8_t*, uint8_t*);
}ADATAFunc;
#endif


#endif

