/******************************Copyright(c)******************************
**                          
**
** File Name: mxflash.c
** Author: 
** Date Last Update: 2015-05-18
** Description: mxic Flash驱动程序
** Note: 
*******************************History***********************************
** Date: 2019-11-02
** Author: yzy
** Description: 文件创建
*************************************************************************/

#ifndef _MXFLASH_H_
#define _MXFLASH_H_



#define FLS_ERR_OK      (uint8)0
#define FLS_ERR_VAR     (uint8)1
#define FLS_ERR_FT      (uint8)2


#define FLS_ERR_EXSIT   (uint8)0x10
#define FLS_ERR_READ    (uint8)0x20
#define FLS_ERR_WRITE   (uint8)0x40

/************************************************************************
**
 ************************************************************************/
typedef struct
{
    uint8  x;                   //存储芯片序号
    uint32 opoffset;            //操作的芯片内数据相对于外部数据的偏移
    uint32 opaddr;              //操作的片内起始地址
    uint32 oplen;               //操作的片内长度

}S_FLSINCHIP;


/*******************************************************************************
** @function_name:  MultiFlashFilterExt
** @function_file:  mxflash.c
** @描述: 输出多芯片文件系统要操作的芯片参数
** 
** 
** @参数: 
** @param: s_out: 数据输出
** @param: address(uint32): 操作地址
** @param: length(uint16): 操作数据的长度
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-11)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
uint32 MultiFlashFilterExt(S_FLSINCHIP* s_out, uint32 address, uint32 length);

/*******************************************************************************
** @function_name:  FLS_AllErase
** @function_file:  mxflash.c
** @描述: MX Flash 全片檫除操作
** 
** 
** @参数: 
** @param: 
** 
** @返回: 
** @return:  void   
** @作者: yzy (2010-05-10)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
void FLS_AllErase(void);

/*******************************************************************************
** @function_name:  FLS_SectorErase
** @function_file:  mxflash.c
** @描述: MX Flash 段檫除操作
** 
** 
** @参数: 
** @param: address(uint32): 
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-10)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
uint8 FLS_SectorErase(uint32 address);

/*******************************************************************************
** @function_name:  FLS_BlockErase
** @function_file:  mxflash.c
** @描述: MX Flash 块64K檫除操作
** 
** 
** @参数: 
** @param: address(uint32): 
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-10)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
uint8 FLS_BlockErase(uint32 address);


/*******************************************************************************
** @function_name:  FLS_SectorBlankCheck
** @function_file:  mxflash.c
** @描述: MX Flash 段空白判断
** 
** 
** @参数: 
** @param: address(uint32)
** 
** @返回: 
** @return:  bool true:全空,false:非空
** @作者: yzy (2012-06-09)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
bool FLS_SectorBlankCheck(uint32 address);



/*******************************************************************************
** @function_name:  FLS_PageBlankCheck
** @function_file:  mxflash.c
** @描述: MX Flash 页空白判断
** 
** 
** @参数: 
** @param: address(uint32)
** 
** @返回: 
** @return:  bool true:全空,false:非空
** @作者: yzy (2012-06-09)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
bool FLS_PageBlankCheck(uint32 address);


/*******************************************************************************
** @function_name:  FLS_WritePage
** @function_file:  mxflash.c
** @描述: Flash页编程
** 
** 
** @参数: 
** @param: buffer(uint8*): 
** @param: address(uint32): 
** @param: length(uint16): 
** @param: x(uint32): 
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-11)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
uint8 FLS_WritePage(uint8* buffer, uint32 address, uint16 length);



/*******************************************************************************
** @function_name:  FLS_Erase
** @function_file:  mxflash.c
** @描述: MX Flash 檫除操作
** 
** 
** @参数: 
** @param: address: 起始地址
** @param: sectornum 扇区数量
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-10)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
uint8 FLS_Erase(uint32 address, uint32 sectornum);


/*******************************************************************************
** @function_name:  FLS_Read
** @function_file:  mxflash.c
** @描述: 从Flash指定地址读取指定长度的字节数据
** 
** 
** @参数: 
** @param: buffer(uint8*): 数据缓存
** @param: address(uint32): 地址
** @param: length(uint16): 读取的数据长度
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-11)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
uint8 FLS_Read(uint8* buffer, uint32 address, uint16 length);


/*******************************************************************************
** 函数名称  void FLS_PreWrite(void)
** 输入  无
** 输出  无
** 说明  预写操作,在写数据之前必须要进行预写操作
** 全局变量:
** 调用模块:
**-----------------------------------------------------------------------------
** 作  者: yzy
** 日　期: 2007年8月8日
*******************************************************************************/
uint8 FLS_PreWrite(void);


/*******************************************************************************
** @function_name:  FLS_Write
** @function_file:  mxflash.c
** @描述: Flash 写操作
** 
** 
** @参数: 
** @param: buffer(uint8*): 
** @param: address(uint32): 
** @param: length(uint16): 
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-11)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
uint8 FLS_Write(uint8* buffer, uint32 address, uint16 length);

/*******************************************************************************
** @function_name:  FLS_WriteSpec
** @function_file:  mxflash.c
** @描述: Flash 特殊写操作
** 
** 
** @参数: 
** @param: buffer(uint8*): 写入数据的内容缓存
** @param: address(uint32): 写入数据的地址
** @param: length(uint16): 写入数据的长度
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-11)
**-----------------------------------------------------------------------------
** @修改人: yzy
** @修改说明: 尽可能地减少檫除的次数(即:当写入数据与原有数据一致或原有数据为FF时不再擦除)
*******************************************************************************/
uint8 FLS_WriteSpec(uint8* buffer, uint32 address, uint16 length);

/*******************************************************************************
** @function_name:  FLS_Set
** @function_file:  mxflash.c
** @描述: Flash 置数标志
** 
** 
** @参数: 
** @param: templet(uint8): 置入的数据
** @param: address(uint32): 写入数据的地址
** @param: length(uint16): 写入数据的长度
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-11)
**-----------------------------------------------------------------------------
** @修改人: yzy
** @修改说明: 操作机制同FLS_Write()
*******************************************************************************/
uint8 FLS_Set(uint8 templet, uint32 address, uint16 length);

/*******************************************************************************
** @function_name:  TestFlashChip
** @function_file:  
** @描述: flash硬件自检
** 
** 
** @参数: 
** 
** @返回: 
** @return:  uint8 位图.1:硬件故障,0:硬件正常.
**                 bit0-bit7分别表示第1-8块flash的硬件状态
** @作者: yzy (2010-05-12)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
uint8 TestFlashChip(void);

/*******************************************************************************
** @function_name:  HAL_InitFlash
** @function_file:  mxflash.c
** @描述: 初始化Flash
** 
** @参数: 
** 
** @返回: 
** @return:  uint8   
** @作者: yzy (2010-05-12)
**-----------------------------------------------------------------------------
** @修改人: 
** @修改说明: 
*******************************************************************************/
uint8 HAL_InitFlash(void);



#endif

