/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: fram.h
**创   建   人: yzy
**最后修改日期: 2007年8月7日
**描        述: 铁电驱动模块操作的头文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2007年8月7日
** 描　述: 原始版本
********************************************************************************************************/

#ifndef _FRAM_H_
#define _FRAM_H_


#define FRAM_ERR_EXIST      (uint8)0x10
#define FRAM_ERR_READ       (uint8)0x20
#define FRAM_ERR_WRITE      (uint8)0x40

#define FRAM_ERR_OK         (uint8)0
#define FRAM_ERR_VAR        (uint8)1
#define FRAM_ERR_FT         (uint8)2

/************************************************************************
 * @function: FRAM_Read
 * @描述: 读取铁电内部指定地址的数据
 * 
 * @参数: 
 * @param: buffer 读取数据的缓存
 * @param: address 读取数据的起始地址
 * @param: length 读取数据的长度
 * 
 * @返回: 
 * @return: TResult  
 * @说明: 
 * @作者: yzy (2014/8/22)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
TResult FRAM_Read(uint8* buffer, uint32 address, uint16 length);

/************************************************************************
 * @function: FRAM_PreWrite
 * @描述: 铁电写数据的预操作
 * @参数: 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/8/22)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 FRAM_PreWrite(void);

/************************************************************************
 * @function: FRAM_Write
 * @描述: 写入铁电内部指定地址的数据
 * 
 * @参数: 
 * @param: buffer 写入数据的缓存
 * @param: address 写入数据的起始地址
 * @param: length 写入数据的长度
 * 
 * @返回: 
 * @return: TResult  
 * @说明: 
 * @作者: yzy (2014/8/22)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
TResult FRAM_Write(uint8* buffer, uint32 address, uint16 length);

/************************************************************************
 * @function: HAL_InitFRAM
 * @描述: 初始化铁电存储器
 * @参数: 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/8/22)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 HAL_InitFRAM(void);




#endif

