/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: saextapi.c
**创   建   人: yzy
**最后修改日期: 2018年3月22日
**描        述: 应用层扩展API文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2018年3月22日
** 描　述: 原始版本
**-------------------------------------------------------------------------------------------------------
** 修改人: 
** 版  本: 
** 描  述: 
********************************************************************************************************/
#ifndef _SAEXTAPI_H_
#define _SAEXTAPI_H_

#ifndef EXT_SAEXTAPI
#define EXT_SAEXTAPI     extern
#endif



/************************************************************************
 * @function: ReadFlash
 * @描述: 从Flash里读取数据,不验证校验码.重试3次
 * 
 * @参数: 
 * @param: fileid 文件号
 * @param: buffer 数据缓冲区
 * @param: len 数组长度
 * @param: start 文件里起始位置
 * 
 * @返回: 
 * @return: bool  读取成功返回true 失败返回false
 * @说明: 
 * @作者: yzy (2013/6/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
TResult ReadFlash(uint16 fileid, uint8* buffer, uint16 len, uint32 start);


/************************************************************************
 * @function: WriteFlash
 * @描述: 对数组计算校验码,写入到Flash里
 * 
 * @参数: 
 * @param: fileid 文件号
 * @param: buffer 数据缓冲区
 * @param: len 数组长度
 * @param: start 文件里起始位置
 * 
 * @返回: 
 * @return: bool  写入成功返回1;失败返回0
 * @说明: 
 * @作者: yzy (2013/6/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
TResult WriteFlash(uint16 fileid, uint8* buffer, uint16 len, uint32 start);


/************************************************************************
 * @function: ReadFlashWithCRC
 * @描述: 从Flash里读取数据,验证校验码,不匹配则清空整个数组
 * 
 * @参数: 
 * @param: fileid 文件号
 * @param: buffer 数据缓冲区
 * @param: len 数组长度
 * @param: start 文件里起始位置
 * 
 * @返回: 
 * @return: bool  校验码正确返回1,不正确返回0
 * @说明: 
 * @作者: yzy (2013/6/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
TResult ReadFlashWithCRC(uint16 fileid, uint8* buffer, uint16 len, uint32 start);


/************************************************************************
 * @function: WriteFlashWithCRC
 * @描述: 对数组计算校验码,写入到Flash里
 * 
 * @参数: 
 * @param: fileid 文件号
 * @param: buffer 数据缓冲区
 * @param: len 数组长度
 * @param: start 文件里起始位置
 * 
 * @返回: 
 * @return: bool  
 * @说明: 
 * @作者: yzy (2013/6/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
TResult WriteFlashWithCRC(uint16 fileid, uint8* buffer, uint16 len, uint32 start);



/************************************************************************
**函数名称: bool STR_IsFlashBitSet(uint16 fileid, uint32 start, uint16 bit)
**描 述: 判断某位是否置一
**
**输 入: 
**       fileid 数据块号
**       start 数据块内位图流起始地址
**       bit 要判断的位数(从0开始)
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: yzy
**日 期: 10-01-26
*************************************************************************/
bool STR_IsFlashBitSet(uint16 fileid, uint32 start, uint16 bit);


/************************************************************************
**函数名称: bool STR_IsFlashBitClr(uint16 fileid, uint32 start, uint16 bit)
**描 述: 判断某位是否为零
**
**输 入: 
**       fileid 数据块号
**       start 数据块内位图流起始地址
**       bit 要判断的位数(从0开始)
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: yzy
**日 期: 10-01-26
*************************************************************************/
bool STR_IsFlashBitClr(uint16 fileid, uint32 start, uint16 bit);



/************************************************************************
 * @function: STR_SetFlashBit
 * @描述: 单位置一
 * 
 * @参数: 
 * @param: fileid 数据块号
 * @param: start 位图起始字节
 * @param: bit   清零的位索引
 * @param: mbyte 位图的最大字节数
 * 
 * @返回: 
 * @return: bool  
 * @说明: 
 * @作者: yzy (2012-9-25)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
bool STR_SetFlashBit(uint16 fileid, uint32 start, uint16 bit, uint16 mbyte);


/************************************************************************
 * @function: STR_ClrFlashBit
 * @描述: 单位置零
 * 
 * @参数: 
 * @param: fileid 数据块号
 * @param: start 位图起始字节
 * @param: bit   清零的位索引
 * @param: mbyte 位图的最大字节数
 * 
 * @返回: 
 * @return: bool  
 * @说明: 
 * @作者: yzy (2012-9-25)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
bool STR_ClrFlashBit(uint16 fileid, uint32 start, uint16 bit, uint16 mbyte);





/************************************************************************
 * @function: SetFlashFrom
 * @描述: 在一个已经打开的数据块内偏移地址起设置一个数据
 * 
 * @参数: 
 * @param: dbno 需要操作的数据块
 * @param: start 需要设置的数据长度
 * @param: len 设置的起始位置
 * @param: data 设置的数据
 * 
 * @返回: 
 * @return: uint8 SYS_ERR_OK / SA_ERR_FT
 * @说明: 
 * @作者: yzy
 *-----------------------------------------------------------------------
 * @修改人: yzy (2011-4-1)
 ************************************************************************/
uint8 SetFlashFrom(uint8 dbno, uint32 start, uint16 len, uint8 data);



int CBB_FILE_Erase_Event (unsigned char type);
int CBB_FILE_Write_Event (unsigned char type, unsigned char * pdata,  int len);
int CBB_FILE_Read_Event (unsigned char type, int start, int num, unsigned char * pdata,  int * len);
int CBB_FILE_Read_Event_Num (unsigned char type,  int * len, int * index);

#endif




