/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: dev_wdt.c
**创   建   人: yzy
**最后修改日期: 2010年09月10日
**描        述: wdt设备模块
*********************************************************************************************************/
#define EXT_DEV_WDT

#include "es.h"
#include "hal.h"
#include "bsp.h"






/*******************************************************************************
 * @function_name:  WDT_Server
 * @function_file:  dev_wdt.c
 * @描述: WDT定时服务程序(100ms周期)
 * 
 * 
 * @参数: 
 * @param: void
 * 
 * @返回: 
 * @return:  void   
 * @作者: yzy (2010-03-11)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
Boolean WDT_Server(void* pdata)
{
    if(guc_TickDogFeedDIS != 0xaa)
    {
        if(guc_TickDogFeedCnt != 0)
        {
            guc_TickDogFeedCnt--;
            
            TDev* dev = SYS_DEV_Open(DEV_NO_SYS, 0, __NULL);
            if(dev != __NULL)
            {
                ((TDevSys*)dev->devfunc)->FeedDOG();
                SYS_DEV_Close(dev);
            }
        }
    }
    
    return true;
}




/*******************************************************************************
 * @function_name:  SYS_WDT_Init
 * @function_file:  
 * @描述: 看门狗初始化
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2010-03-11)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_WDT_Init(void)
{
    //使能高级看门狗
    guc_TickDogFeedDIS = 0;
    //初始化喂狗值
    guc_TickDogFeedCnt = 100;
    //创建亮灯服务定时器
    SYS_Timer_Create(WDT_Server, __NULL, 10, TIMER_ID_WDT, false);
}



/*******************************************************************************
 * @function_name:  WDT_Feed
 * @function_file:  dev_wdt.c
 * @描述: 喂狗
 * 
 * 
 * @参数: 
 * @param: wdttick.狗的寿命(单位100ms)
 * 
 * @返回: 
 * @return:  void   
 * @作者: yzy (2010-03-11)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_WDT_Feed(uint8 wdttick)   
{
    guc_TickDogFeedCnt = wdttick;
}



/*******************************************************************************
 * @function_name:  SYS_WDT_DIS
 * @function_file:  dev_wdt.c
 * @描述: 停止喂狗
 * 
 * @参数: 仅限测试使用.注意,有外部看门狗的时候禁用内部看门狗.否则测试时无法有效测试外部看门狗
 * @返回: 
 * @作者: yzy (2010-03-11)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_WDT_DIS(void)
{
    guc_TickDogFeedDIS = 0xaa;
}

