/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: dev_system.c
**创   建   人: yzy
**最后修改日期: 2018年2月20日
**描        述: 系统设备
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2018年2月20日
** 描　述: 原始版本
********************************************************************************************************/
#define EXT_DEV_SYSTEM


#include "es.h"
#include "hal.h"
#include "bsp.h"



/***********************************************************
 * @function_name: gf_DevSys
 * @function_file: freq.c
 * @描述:系统设备对外声明的函数
 * 
 * @参数: 
 * @返回: 
 * @作者:
 *---------------------------------------------------------
 * @修改人: houpm (2010/2/18)
 **********************************************************/
const TDevSys gf_DevSys = 
{
    {__NULL, __NULL},
    PW_LPCEnter,
    RTC_SetTimes,
    RTC_GetTimes,
    SYS_FeedDOG,
    SYS_OpenSWDOG,
    SYS_Reset,
};


/***********************************************************
 * @function_name: DEV_SysInit
 * @function_file: freq.c
 * @描述:将基本系统作为一个设备访问
 * 
 * @参数: 
 * @返回: 
 * @作者:
 *---------------------------------------------------------
 * @修改人: houpm (2010/2/18)
 **********************************************************/
void DEV_SysInit(void)
{
    TDev* dev = (TDev*)SYS_GetMEM(sizeof(TDev));
    dev->res = __NULL;
    dev->devno = DEV_NO_SYS;
    dev->devfunc = (TDevConst*)&gf_DevSys;
    SYS_DEV_Add(dev);
}














