/****************************************Copyright (c)**************************
**                               	________科技有限公司
**                                     		开发部
**
**
**--------------文件信息--------------------------------------------------------
**文   件   名: dev_hwtimer.c
**创   建   人: yzy
**最后修改日期: 2010年02月19日
**描        述: 实时时钟处理函数
**注        意:
**--------------历史版本信息----------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2010年02月19日
** 描　述: 原始版本
*******************************************************************************/
#define EXT_DEV_HWTIMER

#include "include.h"
/************************************************************************
**声明外部变量
************************************************************************/
extern const TimerID* const gss_TimerSID[NO_OF_TIMERERRUPT];

/*******************************************************************************
 * @function_name:  SYS_HWTIMER_Init
 * @function_file:  dev_hwtimer.c
 * @描述: 
 * 
 * @参数: 
 * @返回: 
 * @作者: yzy (2010-02-20)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_HWTIMER_Init(void)
{
#if (SYS_TIMER_EN > 0)
    for(uint8 uc_i = 0; uc_i < NO_OF_TIMERERRUPT; uc_i++)
    {
        HAL_Init_CH_Timer(gss_TimerSID[uc_i]);
        Timerx_Enable(gss_TimerSID[uc_i]);
    }
#endif    

}

/*******************************************************************************
 * @function_name:  SYS_HWTIMER_Open
 * @function_file:  dev_hwtimer.c
 * @描述: 打开定时器
 * 
 * 
 * @参数: 
 * @param: ch
 * 
 * @返回: 
 * @return:  void   
 * @作者: yzy (2018-03-02)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_HWTIMER_Open(uint8 ch)
{
    Timerx_Enable(gss_TimerSID[ch]);
}

/*******************************************************************************
 * @function_name:  SYS_HWTIMER_Close
 * @function_file:  dev_hwtimer.c
 * @描述: 关闭定时器
 * 
 * 
 * @参数: 
 * @param: key
 * 
 * @返回: 
 * @return:  void    
 * @作者: yzy (2018-03-02)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void SYS_HWTIMER_Close(uint8 ch)
{
    Timerx_Disable(gss_TimerSID[ch]);
}

const _F_HWTIMER gs_HwTimer = 
{
    SYS_HWTIMER_Init,
    SYS_HWTIMER_Open,
    SYS_HWTIMER_Close,
};


