/****************************************Copyright (c)**************************************************
**                               	____科技有限公司
**                                     		开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: atstd.h
**创   建   人: yzy
**最后修改日期: 2014年11月19日
**描        述: 通用AT指令集的驱动函数集
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2014年11月19日
** 描　述: 原始版本
********************************************************************************************************/
#ifndef _ATSTD_H_
#define _ATSTD_H_



#ifndef EXT_ATSTD
#define EXT_ATSTD extern
#endif


/*************************************************************************
*接收AT指令序列的枚举
**************************************************************************/
typedef enum                      		//与STD_ATRecvHdr对应
{
    AT_OK = 0,

    AT_RING,
    AT_ERROR,
    AT_NC,
    AT_BS,
    AT_CONNECT,
    AT_GT,
    AT_CSQ,
    AT_CREG,
    AT_CME,                              //错误提醒
    AT_CMTI,                             //新短信提醒
    AT_CMGS,
    AT_CMGR,
    AT_CMGD,
    AT_CMGL,
    
    NUM_AT_RECVITM,                      //可解析指令的数量
}STDAT_RECV;


/*************************************************************************
*AT指令接收预处理函数集
**************************************************************************/
extern const DecodeRecvData gs_STDATDecodeRecvData[];


/************************************************************************
* 标准操作的步骤集合
*************************************************************************/
extern const ModemElement* const gs_STDAT[];
extern const uint8 STDAT_ELEMENT_NUM;


/************************************************************************
 * @function: ATCommandRecvMap
 * @描述:  扫描串口缓存中的数据是否符合命令序列(若扫描成功,从串口中删除对应特征字符串)
 * 
 * @参数: 
 * @param: atRecvHdr at指令识别码字符串列表
 * @param: itmnum 列表项长度
 * 
 * @返回: 
 * @return: uint8  0-0xfe 扫描到符合指令的索引编号/0xFF 扫描不符合指令
 * @说明: 
 * @作者: yzy (2014/11/17)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 ATCommandRecvMap(const string* atRecvHdr, uint8 itmnum);





#endif

