
#include "public.h"

const CDATAToBG gs_CDATAToBG[] = 
{

/************************************************************************ 
**645-2007.AFN0C实时抄读标识 
*************************************************************************/ 
    {
        0x9EA0,                   //A相+W-W+Q-Q(9EA0-9EA3)
        0x00000015,
        __NULL,
    },
    {
        0x9EA4,                   //B相+W-W+Q-Q(9EA4-9EA7)
        0x00000029,
        __NULL,
    },
    {
        0x9EA8,                   //C相+W-W+Q-Q(9EA8-9EAB)
        0x0000003D,
        __NULL,
    },
    {
        0x9EAC,                   //上一结算日A相+W-W+Q-Q(9EAC-9EAF)
        0x00010015,
        __NULL,
    },
    {
        0x9EB0,                   //上一结算日B相+W-W+Q-Q(9EB0-9EB3)
        0x00010029,
        __NULL,
    },
    {
        0x9EB4,                   //上一结算日C相+W-W+Q-Q(9EB4-9EB7)
        0x0001003D,
        __NULL,
    },
    //---------------
    {
        0x9EC0,                   //上一结算日+W-W+Q-QQ1Q2Q3Q4(9EC0-9EC7)
        0xFF010001,
        __NULL,
    },
    //---------------
    {
        0x9ECC,                   //+W-W+Q-Q需量及时间(9ECC-9ECF)
        0xFF000101,
        __NULL,
    },
    {
        0x9ED0,                   //上一结算日+W-W+Q-Q需量及时间(9ED0-9ED3)
        0xFF010101,
        __NULL,
    },

/************************************************************************ 
**645-1997.AFN0C实时抄读标识 
*************************************************************************/ 
    {
        0x9F00,                   //上月+W
        0x941F,
        __NULL,
    },
    {
        0x9F01,                   //上月+Q
        0x951F,
        __NULL,
    },
    {
        0x9F02,                   //上月-W
        0x942F,
        __NULL,
    },
    {
        0x9F03,                   //上月-Q
        0x952F,
        __NULL,
    },
    {
        0x9F04,                   //上月Q1
        0x953F,
        __NULL,
    },
    {
        0x9F05,                   //上月Q2
        0x955F,
        __NULL,
    },
    {
        0x9F06,                   //上月Q3
        0x956F,
        __NULL,
    },
    {
        0x9F07,                   //上月Q4
        0x954F,
        __NULL,
    },
    {
        0x9F08,                    //+W(需量)
        0xA01F,
        __NULL,
    },
    {
        0x9F09,                    //+WT
        0xB01F,
        __NULL,
    },
    {
        0x9F0A,                    //+Q
        0xA11F,
        __NULL,
    },
    {
        0x9F0B,                    //+QT
        0xB11F,
        __NULL,
    },
    {
        0x9F0C,                    //-W
        0xA02F,
        __NULL,
    },
    {
        0x9F0D,                    //-WT
        0xB02F,
        __NULL,
    },
    {
        0x9F0E,                    //-Q
        0xA12F,
        __NULL,
    },
    {
        0x9F0F,                    //-QT
        0xB12F,
        __NULL,
    },
    {
        0x9F10,                   //上月正向有功需量
        0xA41F,
        __NULL,
    },
    {
        0x9F11,                   //上月正向有功需量时间
        0xB41F,
        __NULL,
    },
    {
        0x9F12,                   //上月正向无功需量
        0xA51F,
        __NULL,
    },
    {
        0x9F13,                   //上月正向无功需量时间
        0xB51F,
        __NULL,
    },
    {
        0x9F14,                   //上月反向有功需量
        0xA42F,
        __NULL,
    },
    {
        0x9F15,                   //上月反向有功需量时间
        0xB42F,
        __NULL,
    },
    {
        0x9F16,                   //上月反向无功需量
        0xA52F,
        __NULL,
    },
    {
        0x9F17,                   //上月反向无功需量时间
        0xB52F,
        __NULL,
    },

};



const uint16 gui_CoreBgTblSize = sizeof(gs_CDATAToBG)/sizeof(CDATAToBG);
