/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: netp_fd.h
**创   建   人: yzy
**最后修改日期: 2013年6月8日
**描        述: 组网功能头文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
**创建人: yzy
**版  本: v1.0
**日　期: 2013年6月8日
**描　述: 原始版本
********************************************************************************************************/
#ifndef _NETP_FD_H_
#define _NETP_FD_H_

#ifndef EXT_NETP_FD
#define EXT_NETP_FD  extern
#endif


/************************************************************************
 * 分配的dlms的起始短地址
************************************************************************/
#define DLMS_SADDR_OFFSET  2        //逻辑地址分配必须从2开始，表计复位以后，表计逻辑自动恢复为1

extern const uint8 DefParaF10[27];
/************************************************************************
 * 系统支持的下挂表最大数量
************************************************************************/
#define DLMS_MT_MAP   3
#define DLMS_MT_MAX   ( CORE_TST_NO - 2 )

/************************************************************************
 * DLMS注册发现服务状态机
************************************************************************/
EXT_NETP_FD     uint8   gc_FindMtMode;      //搜表模式 0：不搜表；1：搜表，自动建档；2搜表，被动建档
typedef struct
{
    //流程控制相关
    uint32 startsecs;                   //搜表起始时间
    uint8  stt;                         //搜表状态
    uint8  err;                         //错误信息
    uint8  vcnt;                        //单步执行等待倒计时
    uint8  nofd;                        //相同上报概率下连续无发现次数(当ratio改变时清零)
    uint8  revd;                        //上报接收到数据,但不确保是否有效.(不建议使用,MBUS总线经常有干扰)
    
    //发现服务参数
    uint8  ratio;                       //上报比率(0-100)
    uint16 slots;                       //上报时间间隙,单位40ms
    
    //发现服务结果
    uint8  ndnum;                       //注册之上报表数量
    uint8  bmap[DLMS_MT_MAP];           //注册之本轮次接收上报注册节点位图.(1有效,0无效)
    
    //已发现DLMS表的注册相关变量
    uint8  ackbidx;                     //待确认从节点位于上报注册节点位图中的索引
    uint8  recerr;                      //接收错误次数
}scm_dlms_t;


EXT_NETP_FD scm_dlms_t gs_scmDlms;



//搜表步骤
#define SCM_STT_IDLE        0x00        //空闲未曾启动(上电时的初始状态)
#define SCM_STT_CKEST       0x01        //CHECK EXISTED
#define SCM_STT_RESET       0x02        //复位
#define SCM_STT_DISCO       0x04        //发现
#define SCM_STT_REGIS       0x08        //注册
#define SCM_STT_FIN         0x10        //完成

#define SCM_STT_EXMASK      0x1F        //排他性步骤标志
//----------------------------------------------------
#define SCM_STT_FIROK       0x80        //上电后首轮搜表完成(未完成时不支持载波抄表)




/************************************************************************
 * PLC通道连续无抄读数据时间
************************************************************************/
EXT_NETP_FD uint32 gul_noPlcReadSecs;

/************************************************************************
 * DLMS下挂表详细信息
************************************************************************/
typedef struct
{
    uint8 systitle[8];                  //system title
    uint8 bgaddr[6];                    //表地址
    uint8 pf;                           //3单相,4三相,others无效.
}dlms_mtdt_t;                           //meter details

typedef struct
{
    dlms_mtdt_t    mt[CORE_TST_NO];    //dlms测量点详细信息
    uint8          eft[DLMS_MT_MAP];   //dlms测量点有效性位图
    uint16         crc;
}dlms_mt_t;

EXT_NETP_FD dlms_mt_t gs_dlmsMt;
EXT_NETP_FD bool gb_dlmsMtFlashCrcOk;      //表示flash中存储的数据是否正确

/************************************************************************
 * @function: MapSystitleToBgaddr
 * @描述: 
 * 
 * @参数: 
 * @param: systitle 输入,8字节
 * @param: bgaddr 输出,6字节
 * 
 * @返回: 
 * @return: uint8 协议类型:3单相,4三相,0xFF处理异常
 * @说明: 举例:systitle-48 58 45 01 30 D1 52 59.单相:表号:0x0D15259=13718105
 * @作者: yzy (2014/6/2)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
//uint8 DLMS_MapSystitleToBgaddr(uint8* systitle, uint8* bgaddr);


/************************************************************************
 * @function: CalcDlmsSaddr
 * @描述: 根据短地址计算出DLMS实际报文中的地址域
 * 
 * @参数: 
 * @param: saddr 短地址
 * 
 * @返回: 
 * @return: uint16 DLMS报文中的短地址域
 * @说明: 
 * @作者: yzy (2014/6/4)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint16 CalcDlmsSaddr(uint16 saddr);


/************************************************************************
 * @function: DLMS_AppReadPack
 * @描述: dlms应用层数据帧打包(增加0x7E帧头,0x7E帧尾,CRC)
 * 
 * @参数: 
 * @param: indata 应用层数据域
 * @param: inlen 应用层数据长度
 * @param: outbuffer 输出帧缓存
 * @param: saddr 短地址
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/6/4)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 DLMS_AppReadPack(uint8* indata, uint8 inlen, uint8* outbuffer, uint16 saddr);


/************************************************************************
 * @function: PST_DLMS_HDLC_Decode
 * @描述: 判断当前缓存里面是否为合法帧,如果是的话则解析成为被动通讯结构体
 * 
 * @参数: 
 * @param: receive 接收到数据的缓存
 * @param: send  需要发送的数据的缓存
 * @param: sbuflen 发送缓存长度
 * @param: frame 数据解析成的结构体
 * 
 * @返回: 
 * @return: uint8  
 * @说明: 
 * @作者: yzy (2014/5/27)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 PST_DLMS_HDLC_Decode(uint8* receive, uint8* send, uint16 sbuflen, PST_Frame* frame);


/************************************************************************
 * @function: PST_DLMS_HDLC_Proc
 * @描述: 
 * 
 * @参数: 
 * @param: frm 数据解析成的结构体
 * 
 * @返回: 
 * @return: uint8  PST_ERR_OK/PST_ERR_FT
 * @说明: 
 * @作者: yzy (2014/5/27)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 PST_DLMS_HDLC_Proc(PST_Frame* frm);



/************************************************************************
 * @function: Netp_DiscoStart
 * @描述: 启动从节点主动注册流程
 * @参数: 
 * @返回: 
 * @说明: 
 * @作者: yzy (2013/7/12)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void Netp_DiscoStart(void);

/************************************************************************
 * @function: Netp_DiscoSetRecvFlag
 * @描述: 发现过程中接收到MBUS数据时置接收标志位
 * 
 * @参数: 
 * @param: 
 * 
 * @返回: 
 * @return: uint8  成功/失败
 * @说明: 
 * @作者: yzy (2013/7/13)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void Netp_DiscoSetRecvFlag(void);


/************************************************************************
 * @function: Netp_FindSecProc
 * @描述: 从节点主动注册流程控制
 * @参数: 
 * @返回: 
 * @说明: 
 * @作者: yzy (2013/7/12)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
void Netp_FindSecProc(void);

/*******************************************************************************
 * @function_name:  Netp_MbusPowerOnDelay
 * @function_file:  netp.c
 * @描述: 等待Mbus电源稳定
 * 
 * 
 * @参数: 
 * 
 * @返回: 
 * @作者: yzy (2011-03-03)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void Netp_MbusPowerOnDelay(void);


/*******************************************************************************
 * @function_name:  ES_Netp_Init
 * @function_file:  netp.c
 * @描述: 进程初始化
 * 
 * 
 * @参数: 
 * 
 * @返回: 
 * @作者: yzy (2011-03-03)
 *-----------------------------------------------------------------------------
 * @修改人: 
 * @修改说明: 
 ******************************************************************************/
void ES_Netp_Init(void);


/************************************************************************
 * @function: ParamLoad_F10
 * @描述: 载入电能表配置参数
 * @参数: 
 * 
 * @返回: 
 * @return: uint8  
 * @说明: M字节序号位图+ n * 27内容
 * @作者: yzy (2014/2/13)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 ParamLoad_F10(void);
/************************************************************************
 * @function: DLMS_ClrRegisMt
 * @描述: 保存下挂表信息列表
 * @参数: 
 * @返回: 
 * @说明: 
 * @作者: ZJC (2014/8/21)
 *-----------------------------------------------------------------------
 ************************************************************************/
void DLMS_ClrRegisMt(void);

/************************************************************************
 * @function: DLMS_DiscoverSend
 * @描述: 搜表发现帧
 * 
 * @参数:
 * @param: pdata 外部传入的发送缓存,目的在于减少栈深度
 * @param: ratio 上报概率(0-100)
 * @param: slots 上报时间片(单位1ms)
 * @返回: uint8 帧长度
 * @说明: 
 * @作者: yzy (2014/5/27)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint8 DLMS_DiscoverSend(uint8* pdata, uint8 ratio, uint16 slots);
#endif












