/****************************************Copyright (c)**************************************************
**                                  ________¿Æ¼¼ÓĞÏŞ¹«Ë¾
**                                          ¿ª·¢²¿
**
**
**--------------ÎÄ¼şĞÅÏ¢--------------------------------------------------------------------------------
**ÎÄ   ¼ş   Ãû: Array.c
**´´   ½¨   ÈË: yzy
**×îºóĞŞ¸ÄÈÕÆÚ: 2007Äê1ÔÂ15ÈÕ
**Ãè        Êö: ¶ÓÁĞº¯Êı¼¯
**×¢        Òâ:
**--------------ÀúÊ·°æ±¾ĞÅÏ¢----------------------------------------------------------------------------
** ´´½¨ÈË: yzy
** °æ  ±¾: v1.0
** ÈÕ¡¡ÆÚ: 2007Äê1ÔÂ15ÈÕ
** Ãè¡¡Êö: Ô­Ê¼°æ±¾
********************************************************************************************************/

#ifndef _ARRAY_H_
#define _ARRAY_H_


/*******************************************************************************
**¶ÓÁĞÊı¾İµ¥ÔªµÄ´óĞ¡
********************************************************************************/
typedef enum
{
    size_array_1 = 1,
    size_array_2 = 2,
    size_array_3 = 4,
    size_array_4 = 8,
    size_array_5 = 16,
    size_array_6 = 32,
    size_array_7 = 64,
    size_array_8 = 128,
    size_array_9 = 256,
}size_array;


/*******************************************************************************
**FIFOµÄ¿ØÖÆ½á¹¹Ìå
********************************************************************************/
typedef struct
{
    void* buffers;
    void* buffere;
    void* head;
    void* tail;
    size_array type;
    uint16 capcity;
    uint16 count;       
}FIFO;

/*******************************************************************************
**LIFOµÄ¿ØÖÆ½á¹¹Ìå
********************************************************************************/
typedef struct
{
    void* bottom;
    void* top;
    void* sp;
    size_array type;
            
}LIFO;

/*******************************************************************************
**ArrayµÄ¿ØÖÆ½á¹¹Ìå
********************************************************************************/
typedef struct
{
    uint16 empty;
    uint16 used;
    size_array type;
    uint16 capcity;
    uint16 count;
    void* data;     
    Word32* link;
}ARRAY;

#define SYS_ARRAY_ERR_OK     (uint8)0
#define SYS_ARRAY_ERR_VAR    (uint8)1
#define SYS_ARRAY_ERR_FT     (uint8)2
#define SYS_ARRAY_ERR_FUL    (uint8)3
#define SYS_ARRAY_ERR_EPY    (uint8)4







/************************************************************************
* @function: SYS_FIFO_Create
* @ÃèÊö: ´´½¨Ò»¸öFIFO
* 
* @²ÎÊı: 
* @param: type ´´½¨µÄFIFOµÄÊı¾İµ¥ÔªµÄÀàĞÍ
* @param: fifo ĞèÒª´´½¨µÄfifo
* @param: buffer ĞèÒª´´½¨µÄFIFOµÄÊı¾İµÄ»º´æÎ»ÖÃ
* @param: length ĞèÒª´´½¨µÄFIFOµÄÊı¾İµ¥ÔªµÄ³¤¶È(×Ö½ÚÊı)
* 
* @·µ»Ø: 
* @return: uint8  
* @ËµÃ÷: 
* @×÷Õß: yzy (2013/6/9)
*-----------------------------------------------------------------------
* @ĞŞ¸ÄÈË: 
************************************************************************/
uint8 SYS_FIFO_Create(size_array type, FIFO* fifo, void* buffer, uint16 length);

/************************************************************************
* @function: SYS_FIFO_Enqueue
* @ÃèÊö: ½«Ò»¸öÊı¾İÅÅµ½¶ÓÁĞÀïÃæÈ¥
* 
* @²ÎÊı: 
* @param: fifo ĞèÒªÈë¶ÓµÄfifo
* @param: content Èë¶ÓµÄÄÚÈİ
* 
* @·µ»Ø: 
* @return: uint8  
* @ËµÃ÷: 
* @×÷Õß: yzy (2013/6/9)
*-----------------------------------------------------------------------
* @ĞŞ¸ÄÈË: 
************************************************************************/
uint8 SYS_FIFO_Enqueue(FIFO* fifo, void* content);

/************************************************************************
* @function: SYS_FIFO_Dequeue
* @ÃèÊö: ´ÓFIFOÀïÃæ»ñÈ¡Ò»¸öÊı¾İ,Õâ¸öÊı¾İ²»ÔÙ´æÔÚFIFOÀïÃæ
* 
* @²ÎÊı: 
* @param: fifo ĞèÒª³ö¶ÓµÄfifo, ×¢ÒâÕâ¸öº¯Êı±¾ÉíÊÇ½ø³Ì°²È«µÄ,µ«ÊÇ»ñÈ¡µÄÄÚÈİÔò²»Ò»¶¨ÁË.
* 
* @·µ»Ø: 
* @return: void*  __NULL±íÊ¾¶ÓÁĞ¿Õ,ÆäËü:³ö¶ÓÊı¾İµÄÄÚÈİµÄµØÖ·
* @ËµÃ÷: 
* @×÷Õß: yzy (2013/6/9)
*-----------------------------------------------------------------------
* @ĞŞ¸ÄÈË: 
************************************************************************/
void* SYS_FIFO_Dequeue(FIFO* fifo);


/************************************************************************
* @function: SYS_FIFO_Get
* @ÃèÊö: ´ÓFIFOÀïÃæ»ñÈ¡Ò»¸öÊı¾İ,Õâ¸öÊı¾İ²»ÔÙ´æÔÚFIFOÀïÃæ
* 
* @²ÎÊı: 
* @param: fifo ĞèÒª³ö¶ÓµÄfifo
* @param: content »ñÈ¡µÄÊı¾İ±£´æµÄÎ»ÖÃ,Õâ¸öº¯ÊıÊÇ½ø³Ì°²È«µÄ.
* 
* @·µ»Ø: 
* @return: uint8  ³É¹¦/Ê§°Ü
* @ËµÃ÷: 
* @×÷Õß: yzy (2013/6/9)
*-----------------------------------------------------------------------
* @ĞŞ¸ÄÈË: 
************************************************************************/
uint8 SYS_FIFO_Get(FIFO* fifo, void* content);

/************************************************************************
* @function: SYS_FIFO_Peek
* @ÃèÊö: ´ÓFIFOÀïÃæ»ñÈ¡Ò»¸öÊı¾İ,Õâ¸öÊı¾İ»¹ÔÚFIFOÀïÃæ×¢ÒâÕâ¸öº¯Êı±¾ÉíÊÇ½ø³Ì°²È«µÄ,µ«ÊÇ»ñÈ¡µÄÄÚÈİÔò²»Ò»¶¨ÁË.
* 
* @²ÎÊı: 
* @param: fifo ĞèÒª»ñÈ¡Êı¾İµÄfifo
* 
* @·µ»Ø: 
* @return: void*  __NULL±íÊ¾¶ÓÁĞ¿Õ   ÆäËü:»ñÈ¡Êı¾İµÄÄÚÈİµÄµØÖ·
* @ËµÃ÷: 
* @×÷Õß: yzy (2013/6/9)
*-----------------------------------------------------------------------
* @ĞŞ¸ÄÈË: 
************************************************************************/
void* SYS_FIFO_Peek(FIFO* fifo);

/************************************************************************
* @function: SYS_FIFO_Clear
* @ÃèÊö: Çå³ıFIFO
* 
* @²ÎÊı: 
* @param: fifo ĞèÒªÇå³ıÊı¾İµÄfifo
* @·µ»Ø: 
* @ËµÃ÷: 
* @×÷Õß: yzy (2013/6/9)
*-----------------------------------------------------------------------
* @ĞŞ¸ÄÈË: 
************************************************************************/
void SYS_FIFO_Clear(FIFO* fifo);



/************************************************************************
 * @function: SYS_LIFO_Create
 * @ÃèÊö: ´´½¨Ò»¸öLIFO
 * 
 * @²ÎÊı: 
 * @param: type ´´½¨µÄLIFOµÄÊı¾İµ¥ÔªµÄÀàĞÍ
 * @param: lifo ĞèÒª´´½¨µÄlifo
 * @param: buffer ĞèÒª´´½¨µÄLIFOµÄÊı¾İµÄ»º´æÎ»ÖÃ
 * @param: length ĞèÒª´´½¨µÄLIFOµÄÊı¾İµÄ³¤¶È(×Ö½ÚÊı)
 * 
 * @·µ»Ø: 
 * @return: uint8  
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
uint8 SYS_LIFO_Create(size_array type, LIFO* lifo, void* buffer, uint16 length);


/************************************************************************
 * @function: SYS_LIFO_Push
 * @ÃèÊö: ½«Ò»¸öÊı¾İÍÆÈëLIFOÖĞ
 * 
 * @²ÎÊı: 
 * @param: lifo ĞèÒªÈë¶ÓµÄlifo
 * @param: content Èë¶ÓµÄÄÚÈİ
 * 
 * @·µ»Ø: 
 * @return: uint8  
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
uint8 SYS_LIFO_Push(LIFO* lifo, void* content);


/************************************************************************
 * @function: SYS_LIFO_Pop
 * @ÃèÊö: ´ÓLIFOÀïÃæ»ñÈ¡Ò»¸öÊı¾İ,Õâ¸öÊı¾İ²»ÔÙ´æÔÚLIFOÀïÃæ
 * 
 * @²ÎÊı: 
 * @param: lifo ĞèÒª³ö¶ÓµÄlifo
 * 
 * @·µ»Ø: 
 * @return: void*  __NULL±íÊ¾¶ÓÁĞ¿Õ ÆäËü:³ö¶ÓÊı¾İµÄÄÚÈİµÄµØÖ·
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
void* SYS_LIFO_Pop(LIFO* lifo);


/************************************************************************
 * @function: SYS_LIFO_Get
 * @ÃèÊö: ´ÓLIFOÀïÃæ»ñÈ¡Ò»¸öÊı¾İ,Õâ¸öÊı¾İ²»ÔÙ´æÔÚLIFOÀïÃæ
 * 
 * @²ÎÊı: 
 * @param: lifo ĞèÒª³ö¶ÓµÄlifo
 * @param: content ±£´æµ¯³öµÄÊı¾İÄÚÈİ
 * 
 * @·µ»Ø: 
 * @return: uint8  
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
uint8 SYS_LIFO_Get(LIFO* lifo, void* content);



/************************************************************************
 * @function: SYS_LIFO_Peek
 * @ÃèÊö: ´ÓLIFOÀïÃæ»ñÈ¡Ò»¸öÊı¾İ,Õâ¸öÊı¾İ»¹ÔÚLIFOÀïÃæ
 * 
 * @²ÎÊı: 
 * @param: lifo ĞèÒª»ñÈ¡Êı¾İµÄlifo
 * 
 * @·µ»Ø: 
 * @return: void*  __NULL±íÊ¾¶ÓÁĞ¿Õ ÆäËü:³ö¶ÓÊı¾İµÄÄÚÈİµÄµØÖ·
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
void* SYS_LIFO_Peek(LIFO* lifo);



/************************************************************************
 * @function: SYS_LIFO_Clear
 * @ÃèÊö: Çå³ıLIFO
 * 
 * @²ÎÊı: 
 * @param: lifo ĞèÒªÇå³ıÊı¾İµÄfifo
 * @·µ»Ø: 
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
void SYS_LIFO_Clear(LIFO* lifo);



/************************************************************************
 * @function: SYS_Array_Create
 * @ÃèÊö: ´´½¨Ò»¸öArray
 * 
 * @²ÎÊı: 
 * @param: type ±íÊ¾¶ÓÁĞÀàĞÍµÄ³¤¶È
 * @param: array ĞèÒª±»³õÊ¼»¯µÄARRAY
 * @param: buffer ¶ÓÁĞËùĞèÒªÊ¹ÓÃµÄ»º´æ
 * @param: length ±íÊ¾ÉÏÃæµÄ»º´æµÄ´óĞ.¨µ¥Î»×Ö½Ú)
 * 
 * @·µ»Ø: 
 * @return: uint8  
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
uint8 SYS_Array_Create(size_array type, ARRAY* array, void* buffer, uint16 length);


/************************************************************************
 * @function: SYS_Array_Add
 * @ÃèÊö: Íù¶ÓÁĞÀïÃæÔö¼ÓÒ»¸öÊı¾İ
 * 
 * @²ÎÊı: 
 * @param: array ĞèÒªÔö¼ÓÊı¾İµÄµÄARRAY
 * @param: content Ôö¼ÓµÄÄÚÈİ
 * 
 * @·µ»Ø: 
 * @return: uint8  
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
uint8 SYS_Array_Add(ARRAY* array, void* content);


/************************************************************************
 * @function: SYS_Array_Remove
 * @ÃèÊö: 
 * 
 * @²ÎÊı: 
 * @param: array ÒªÉ¾³ıÊı¾İµÄARRAY
 * @param: index ÒªÉ¾³ıÊı¾İµÄË÷Òı
 * 
 * @·µ»Ø: 
 * @return: uint8  
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
uint8 SYS_Array_Remove(ARRAY* array, uint16 index);


/************************************************************************
 * @function: SYS_Array_Get
 * @ÃèÊö: ´ÓArrayÀïÃæ»ñÈ¡Ò»¸öÊı¾İ
 * 
 * @²ÎÊı: 
 * @param: array ĞèÒª»ñÈ¡µÄÊı¾İËùÔÚµÄarray
 * @param: index ĞèÒª»ñÈ¡µÄÊı¾İµÄË÷Òı
 * 
 * @·µ»Ø: 
 * @return: void*  __NULL »ñÈ¡Êı¾İÊ§°Ü   ÆäËü,»ñÈ¡µÄËùÔÚµÄµØÖ·
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
void* SYS_Array_Get(ARRAY* array, uint16 index);


/************************************************************************
 * @function: SYS_Array_Set
 * @ÃèÊö: ½«ArrayÀïÃæµÄÒ»¸öÊı¾İµÄÄÚÈİ¸ü¸Ä
 * 
 * @²ÎÊı: 
 * @param: array ĞèÒª¸ü¸ÄµÄÊı¾İËùÔÚµÄarray
 * @param: index ĞèÒª¸ü¸ÄµÄÊı¾İµÄË÷Òı
 * @param: content ĞèÒªÉèÖÃµÄÄÚÈİ
 * 
 * @·µ»Ø: 
 * @return: uint8  
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
uint8 SYS_Array_Set(ARRAY* array, uint16 index, void* content);


/************************************************************************
 * @function: SYS_Array_Clear
 * @ÃèÊö: Çå³ıARRAY
 * 
 * @²ÎÊı: 
 * @param: array ĞèÒªÇå³ıÊı¾İµÄarray
 * @·µ»Ø: 
 * @ËµÃ÷: 
 * @×÷Õß: yzy (2013/6/9)
 *-----------------------------------------------------------------------
 * @ĞŞ¸ÄÈË: 
 ************************************************************************/
void SYS_Array_Clear(ARRAY* array);



#endif
