/****************************************Copyright (c)**************************************************
**                                  ________科技有限公司
**                                          开发部
**
**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: stream.h
**创   建   人: yzy
**最后修改日期: 2011-04-01
**描        述: 字符串函数库头文件
**注        意:
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: yzy
** 版  本: v1.0
** 日　期: 2011-04-01
** 描　述: 原始版本
********************************************************************************************************/
#ifndef _STRING_H_
#define _STRING_H_


/************************************************************************
**函数名uint8bool STR_IsBcd(uint8* data, uint8 num)
**描 述: 
**
**输 入: 
**输 出: 
**
**备 注: 
**--------------------------------------------------------
**作 者: yzy
**日 期: 2010-12-10
*************************************************************************/
uint8 STR_IsBcd(uint8* data, uint8 num);


/************************************************************************
**函数名称: uint8 STR_IsEmpty(uint8* s, uint8 num)
**描 述: 检查是否为空串(全为零)
**
**输 入: s 比特流; no 字节长度
**输 出: false有内容
         true空串
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint8 STR_IsEmpty(uint8* s, uint8 num);


/************************************************************************
**函数名uint8bool STR_IsBitSet(uint8* stream, uint16 bit)
**描 述: 判断某位是否置一
**
**输 入: steam 比特流, bit 要判断的位数(从0开始)
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: yzy
**日 期: 10-01-26
*************************************************************************/
uint8 STR_IsBitSet(uint8* stream, uint16 bit);

/************************************************************************
**函数名uint8bool STR_IsBitClr(uint8* stream, uint16 bit)
**描 述: 判断某位是否为零
**
**输 入: steam 比特流, bit 要判断的位数(从0开始)
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: yzy
**日 期: 10-01-26
*************************************************************************/
uint8 STR_IsBitClr(uint8* stream, uint16 bit);

/************************************************************************
 * @function: STR_IsBitsState
 * @描述: 判断某些位是否全为1或0
 * 
 * 
 * @参数: 
 * @param: stream  比特流
 * @param: bit  要判断的起始位数(从0开始)
 * @param: num  要判断的位数
 * @param: oc  真:为1,假:为0
 * 
 * @返回: 
 * @return:  uint8   
 * @作者: yzy (2010-10-8)
 ***----------------------------------------------------------------------
 * @修改人: 
 *************************************************************************/
uint8 STR_IsBitsState(uint8* stream, uint16 bit, uint8 num, uint8 oc);


/************************************************************************
**函数名称: uint16 STR_CalcBitSetNum(uint8* dat, uint8 num)
**描 述: 找出二进制流dat中1的位数
**
**输 入: dat 比特流
         num 字节数
**输 出: 
**
**备 注: 
**--------------------------------------------------------
**作 者: yzy
**日 期: 
*************************************************************************/
uint16 STR_CalcBitSetNum(uint8* dat, uint8 num);

/************************************************************************
 * @function: STR_CalcBitClrNum
 * @描述: 找出二进制流dat中0的位数
 * 
 * @参数: 
 * @param: dat 比特流
 * @param: num 字节数
 * 
 * @返回: 
 * @return: uint16  
 * @说明: 
 * @作者: yzy (2013/6/20)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint16 STR_CalcBitClrNum(uint8* dat, uint8 num);


/************************************************************************
**函数名称: uint16 STR_CalcBitSetNum_Before(uint8* str, uint16 idx)
**描 述: 计算比特流的idx位前一共有几位置1(含idx位)
**
**输 入: str 比特流
         idx 要计算的那一位
**输 出: idx前置一的位数
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_CalcBitSetNum_Before(uint8* str, uint16 idx);


/************************************************************************
**函数名称: uint16 STR_GetFirstBit(uint8* str, uint8 nuint8bool set)
**描 述: 查找比特流中首个为0或1的位
**
**输 入: str 比特流
         num 比特流的字节数
         set true 为1, false 为0
**输 出: 0xFFFF: 找不到
         others: str中首个为一的位
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_GetFirstBit(uint8* str, uint8 num, uint8 set);


/************************************************************************
**函数名称: uint16 STR_GetFirstSetBit(uint8* str, uint8 num)
**描 述: 查找比特流中首个为一的位
**
**输 入: str 比特流
         num 比特流的字节数
**输 出: 0xFFFF: 找不到
         others: str中首个为一的位
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_GetFirstSetBit(uint8* str, uint8 num);


/************************************************************************
**函数名称: uint16 STR_GetFirstClrBit(uint8* str, uint8 num)
**描 述: 查找比特流中首个为零的位
**
**输 入: str 比特流
         num 比特流的字节数
**输 出: 0xFFFF: 找不到
         others: str中首个为零的位
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_GetFirstClrBit(uint8* str, uint8 num);



/************************************************************************
**函数名称: uint16 STR_GetSpecSetBit(uint8* dat, uint8 datlen, uint16 xh)
**描 述: 查找比特流中第N个为1位的位索引
**
**输 入: dat 比特流
         datlen 比特流的字节数
         xh 第N个位(0-!)
**输 出: 0xFFFF: 找不到
         others: 首个为一的位(0~!)
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_GetSpecSetBit(uint8* dat, uint8 datlen, uint16 xh);

/************************************************************************
**函数名称: uint16 STR_GetSpecClrBit(uint8* dat, uint8 datlen, uint16 xh)
**描 述: 查找比特流中第N个为0位的位索引
**
**输 入: dat 比特流
         datlen 比特流的字节数
         xh 第N个位(0-!)
**输 出: 0xFFFF: 找不到
         others: 首个为0的位(0~!)
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_GetSpecClrBit(uint8* dat, uint8 datlen, uint16 xh);


/************************************************************************
**函数名称: uint16 STR_GetLastSetBit(uint8* str, uint8 num)
**描 述: 查找比特流中最后一个置一的位
**
**输 入: str 比特流
         num 比特流的字节数
**输 出: 0xFFFF: 找不到
         others: 位索引
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_GetLastSetBit(uint8* str, uint8 num);


/************************************************************************
**函数名称: uint16 STR_GetLastClrBit(uint8* str, uint8 num)
**描 述: 查找比特流中最后一个置零的位
**
**输 入: str 比特流
         num 比特流的字节数
**输 出: 0xFFFF: 找不到
         others: 位索引
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: yzy
**日 期: 2009-03-16
*************************************************************************/
uint16 STR_GetLastClrBit(uint8* str, uint8 num);


/************************************************************************
**函数名称: uint16 STR_GetNextBit(uint8* str, uint8 num, uint16 cuint8bool set)
**描 述: 求cur位之后第一个为1或为0的位索引
**
**输 入: str 比特流
         num 比特流长度
         cur 当前所在的位置
         set true 为1; false 为0
**输 出: 0xFFFF: 找不到
         others: 位索引
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_GetNextBit(uint8* str, uint8 num, uint16 cur, uint8 set);



/************************************************************************
**函数名称: uint16 STR_GetNextSetBit(uint8* str, uint8 num, uint16 cur)
**描 述: 求cur位之后第一个置一的位索引
**
**输 入: str 比特流
         num 比特流长度
         cur 当前所在的位置
**输 出: 0xFFFF: 找不到
         others: 位索引
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_GetNextSetBit(uint8* str, uint8 num, uint16 cur);


/************************************************************************
**函数名称: uint16 STR_GetNextClrBit(uint8* str, uint8 num, uint16 cur)
**描 述: 求cur位之后第一个为零的位索引
**
**输 入: str 比特流
         num 比特流长度
         cur 当前所在的位置
**输 出: 0xFFFF: 找不到
         others: 位索引
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint16 STR_GetNextClrBit(uint8* str, uint8 num, uint16 cur);



/************************************************************************
 * @function: STR_GetThisNextSetBit
 * @描述: 求cur位自身及之后第一个置一的位索引
 * 
 * @参数: 
 * @param: str 
 * @param: num 
 * @param: cur 
 * 
 * @返回: 
 * @return: uint16  
 * @说明: 
 * @作者: yzy (2011-3-16)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint16 STR_GetThisNextSetBit(uint8* str, uint8 num, uint16 cur);



/************************************************************************
 * @function: STR_GetThisNextClrBit
 * @描述: 求cur位自身及之后第一个为零的位索引
 * 
 * @参数: 
 * @param: str 
 * @param: num 
 * @param: cur 
 * 
 * @返回: 
 * @return: uint16  
 * @说明: 
 * @作者: yzy (2011-3-16)
 *-----------------------------------------------------------------------
 * @修改人: 
 ************************************************************************/
uint16 STR_GetThisNextClrBit(uint8* str, uint8 num, uint16 cur);


/************************************************************************
**函数名称: void STR_Or(uint8* s1, uint8* s2, uint8* des, uint16 num)
**描 述: 将s1和s2比特流相或,输出到des比特流
**
**输 入: 
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
void STR_Or(uint8* s1, uint8* s2, uint8* des, uint16 num);

/************************************************************************
**函数名uint8bool STR_And(uint8* s1, uint8* s2, uint8* des, uint8 num)
**描 述: 将s1和s2比特流相与,输出到des比特流
**
**输 入: 
**输 出: true: 输出为全零比特流
         false: 输出为非零比特流
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint8 STR_And(uint8* s1, uint8* s2, uint8* des, uint8 num);

/************************************************************************
**函数名称: void STR_Xor(uint8* s, uint8* des, uint8 num)
**描 述: des = s1 ^ s2
**
**输 入: 
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: yzy
**日 期: 09-11-07
*************************************************************************/
void STR_Xor(uint8* s1, uint8* s2, uint8* des, uint8 num);

/************************************************************************
**函数名称: void STR_AndNot(uint8* s1, uint8* s2, uint8* des, uint8 num)
**描 述: des = s1 && ~s2 
**       即获取s1中置位而s2中为零的位 
**
**输 入: 
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
void STR_AndNot(uint8* s1, uint8* s2, uint8* des, uint8 num);

/************************************************************************
**函数名称: void STR_Not(uint8* s, uint8* des, uint8 num)
**描 述: 将s取反,输出到des比特流
**
**输 入: 
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
void STR_Not(uint8* s, uint8* des, uint8 num);




/************************************************************************
**函数名称: void STR_SetBits()
**描 述: 设置比特流中某几位
**
**输 入: steram 比特流
        count 需要设置的bit的数量(<=8)
        start 从哪一个位开始设置
        value 设置的值
**输 出: 
**
**备 注: 对 SetStreamBits() 的扩展
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
void STR_SetBits(uint8* stream, uint8 count, uint16 start, uint8 value);



/************************************************************************
 * @function: STR_IsBitsSet
 * @描述: 判断某些位是否全置一
 * 
 * 
 * @参数: 
 * @param: stream  比特流
 * @param: bit 要判断的起始位数(从0开始)
 * @param: num 要判断的位数
 * 
 * @返回: 
 * @return:  uint8 
 * @作者: yzy (2010-10-7)
 ***----------------------------------------------------------------------
 * @修改人: 
 *************************************************************************/
uint8 STR_IsBitsSet(uint8* stream, uint16 bit, uint8 num);



/************************************************************************
 * @function: STR_IsBitsClr
 * @描述: 判断某些位是否全为零
 * 
 * 
 * @参数: 
 * @param: stream  比特流
 * @param: bit 要判断的起始位数(从0开始)
 * @param: num 要判断的位数
 * 
 * @返回: 
 * @return:  uint8 
 * @作者: yzy (2010-10-7)
 ***----------------------------------------------------------------------
 * @修改人: 
 *************************************************************************/
uint8 STR_IsBitsClr(uint8* stream, uint16 bit, uint8 num);



/************************************************************************
**函数名称: void STR_SetBit(uint8* stream, uint16 bit)
**描 述: 单位置一
**
**输 入: 
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: yzy
**日 期: 10-01-26
*************************************************************************/
void STR_SetBit(uint8* stream, uint16 bit);

/************************************************************************
**函数名称: void STR_ClrBit(uint8* stream, uint16 bit)
**描 述: 单位置零
**
**输 入: 
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: yzy
**日 期: 10-01-26
*************************************************************************/
void STR_ClrBit(uint8* stream, uint16 bit);

/************************************************************************
**函数名称: STR_AdvSetBits
**描 述: 设置比特流的若干位
**
**输 入: stream 比特流
        count 需要设置的bit的数量(<=8)
        start 从哪一个位开始设置
        value 设置的值
**输 出: 
**
**备 注: 对 SetStreamBits() 的扩展
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
void STR_AdvSetBits(uint8* stream, uint16 count, uint16 start);

/************************************************************************
**函数名称: STR_AdvClrBits
**描 述: 设置比特流的若干位
**
**输 入: stream 比特流
        count 需要设置的bit的数量
        start 从哪一个位开始设置
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
void STR_AdvClrBits(uint8* stream, uint16 count, uint16 start);

/************************************************************************
**函数名称: STR_GetBits(uint8* stream, uint8 count, uint16 start)
**描 述: 读取比特流中某几位
**
**输 入: steram 比特流
        count 需要读取的bit的数量(<=8)
        start 从哪一个位开始读取
**输 出: 
**
**备 注: 
**-----------------------------------------------------------------------
**作 者: 
**日 期: 
*************************************************************************/
uint8 STR_GetBits(uint8* stream, uint8 count, uint16 start);

#endif





